<html>
  <head>
        <link href="../datacrow_help.css" rel="stylesheet" type="text/css">
  </head>
  <body>
    <h1>Servidor Web</h1>
    <i>Caminho de menu: Servidor Web &gt; Servidor Web</i><br>
    
    <p>
    Ao usar este di&aacute;logo, pode configurar e iniciar o servidor Web.
    O di&aacute;logo <b>Servidor Web</b> pode ser aberto do menu de servidor Web.
    </p>
    
    <h2>Defini&ccedil;&otilde;es do servidor Web</h2>
    <p>
    Aqui pode definir qual a porta onde o servidor vai correr. O Data Crow n&atilde;o verifica se a porta est&aacute; bloqueada
    por programas de seguran&ccedil;a. Para isto, sugiro que consulte a documenta&ccedil;&atilde;o do seu sistema operativo 
    e/ou a documenta&ccedil;&atilde;o do programa de seguran&ccedil;a instalado. 
    </p>
    
    <h2>Estado do servidor Web</h2>
    <p>
   	Aqui &eacute; mostrado o estado atual do servidor. Pode iniciar o servidor clicando no bot&atilde;o azul &quot;Reproduzir&quot;. 
	O bot&atilde;o azul "Parar" p&aacute;ra o servidor, tornando a aplica&ccedil;&atilde;o Web inalcan&ccedil;&aacute;vel para 
	o mundo exterior.
    </p>
    
    <h2>Navegar at&eacute; ao ambiente Web</h2>
    <p>
    Abra o ambiente Web premindo o bot&atilde;o &quot;Ir para a aplica&ccedil;&atilde;o Web&quot;
    ou introduzindo o seguinte URL no seu navegador: <br>
    http://localhost:&lt;port&gt;/datacrow<br><br>
    
    Substitua a &lt;porta&gt; com o n&uacute;mero de porta configurado. A primeira parte do URL &eacute; o endere&ccedil;o do servidor.
    Se executar localmente pode usar o seu localhost como endere&ccedil;o.
    Para o mundo exterior deve usar o endere&ccedil;o IP da sua m&aacute;quina.
    </p>
    
    <h2>Seguran&ccedil;a</h2>
    <p>
    O m&oacute;dulo Web usa os mesmos utilizadores que o programa Data Crow atual. Recomenda-se que crie utilizadores separados
	e que defina uma palavra-passe para cada um.
    </p>
    
    <h2>Configurar o ambiente Web</h2>
    <p>
    Os resumos dos itens podem ser configurados usando as &quot;Defini&ccedil;&otilde;es de campos Web&quot;.
    Pode definir quais campos s&atilde;o mostrados e em que ordem. As p&aacute;ginas de detalhes do item dependem das 
	predefini&ccedil;&otilde;es. Por favor note que os campos mostrados tamb&eacute;m dependem dos direitos de acesso do utilizador. 
    </p>
    
  </body>
</html>