<html>
  <head>
        <link href="../datacrow_help.css" rel="stylesheet" type="text/css">
  </head>
  <body>
    <h1>Gest&atilde;o de itens de propriedade</h1>
    <i>Caminho de menu: &gt; Gest&atilde;o &gt; Manter &lt;nome&gt;</i><br><br>
    
    O menu <b>Gest&atilde;o</b> permite-lhe gerir os itens de propriedade, como categorias, pa&iacute;ses, e estados. 
    O resumo mostra todos os itens numa lista, ordenada alfabeticamente. Pode abrir um item e edit&aacute;-lo.
    
    <br><br><img src="./images/administration_pt.png" alt="" border="0"><br><br>

    <h2>Filtrar</h2>
    Pode filtrar a lista introduzindo texto no campo ao cimo da janela. Os itens s&atilde;o imediatamente filtrados ao escrever.
    O filtro procura por itens cujo nome comece pelo valor introduzido. Remover o texto mostra a lista toda novamente.

    <h2>Criar m&uacute;ltiplos itens</h2>
    Se quer criar m&uacute;ltiplos itens em simult&acirc;neo, clique em <b>Criar m&uacute;ltiplos itens</b>.

    <br><br><img src="./images/administration_createmultiple_pt.png " alt="" border="0"><br><br>
    
    Para acrescentar uma linha a este resumo clique em <b>Adicionar</b>. Clique na linha e comece a escrever. Assim que tiver introduzido
	a informa&ccedil;&atilde;o em todas as linhas clique em <b>Gravar</b>.
    Os seus itens est&atilde;o criados!  

    <h2>Abrir um item</h2>
    Abra o <a href="../items/itemform.html">Formul&aacute;rio de item</a> com um duplo clique. 
    Aqui pode ver e/ou editar o item (dependendo dos seus direitos, definidos na <a href="../security/security.html">seguran&ccedil;a</a> 
	e nas <a href="../settings/general.html">defini&ccedil;&otilde;es gerais</a>). 
    
    <h2>Apagar um item</h2>
    Se clicar com o bot&atilde;o direito num dos itens, pode optar por apag&aacute;-lo.<br> 
    O item n&atilde;o pode ser apagado se estiver a ser usado por outros itens. Por exemplo, Se tiver um pa&iacute;s atribu&iacute;do a 
	tr&ecirc;s filmes, n&atilde;o o poder&aacute; apagar. O sistema avisa-o quando for necess&aacute;rio. Para o apagar, primeiro tem de 
	remover todas as refer&ecirc;ncias ao item (veja o pr&oacute;ximo par&aacute;grafo).<br>
    
    <h2>Apagar itens n&atilde;o atribu&iacute;dos</h2>
    Se a lista se tornou muito grande, poder&aacute; ser boa ideia remover todos os itens n&atilde;o usados (por exemplo, um estado que n&atilde;o 
	foi definido para nenhum item). Selecione <b>Editar</b> no menu e selecione <b>Apagar n&atilde;o atribu&iacute;dos &lt;nome&gt;</b>.
    
    <h2>Unir itens</h2>
    Pode unir m&uacute;ltiplos itens num s&oacute;. Esta a&ccedil;&atilde;o &eacute; explicada <a href="merging_property_items.html">aqui</a>.
    
    <h2>Itens/Refer&ecirc;ncias relacionadas</h2>
    Para ver como um item foi usado, abra-o e veja o separador <b>Itens relacionados</b> no 
    <a href="../items/itemform.html">Formul&aacute;rio de item</a>.

    <h2>Defini&ccedil;&otilde;es</h2>
    O menu <b>Defini&ccedil;&otilde;es</b> cont&eacute;m as op&ccedil;&otilde;es <a href="../settings/fields.html">Defini&ccedil;&otilde;es gerais de campos</a> 
	e <a href="../settings/itemformsettings.html">Defini&ccedil;&otilde;es do formul&aacute;rio de item</a>.

  </body>
</html>
