<html>
  <head>
        <link href="../datacrow_help.css" rel="stylesheet" type="text/css">
  </head>

  <body>
  
    <h1>Formul&aacute;rio de item</h1>
    <i>Caminho de menu &gt; Ficheiro &gt; Novo (Ctrl-N)</i><br>
    <i>ou duplo clique num item existente na vista</i><br><br>

    O formul&aacute;rio de item mostra um &uacute;nico item, novo ou existente. O formul&aacute;rio permite criar, atualizar ou apagar um item.

	<br><br><img src="./images/itemform_pt.png" alt="" border="0"><br><br>

    Pode gravar as altera&ccedil;&otilde;es clicando em <b>Gravar</b>. Clicar em <b>Cancelar</b> descarta todas as altera&ccedil;&otilde;es efetuadas 
	(&eacute; mostrado um aviso antes) e fecha o formul&aacute;rio. Para apagar um item clique em <b>Apagar</b>.

    <h2>Bot&otilde;es</h2>
    Podem ser mostrados no formul&aacute;rio os seguintes bot&otilde;es:
    
    <br><br><img src="./images/itemform_buttons_pt.png" alt="" border="0"><br><br>
    
	<table cellspacing="2" cellpadding="2" border="0">
    	<tr><td>-</td>
    		<td><b>Atualizar</b>: 
            nem todos os m&oacute;dulos oferecem <a href="../onlinesearch/onlinesearch.html">servi&ccedil;os online</a>. Se esta funcionalidade
            estiver dispon&iacute;vel encontrar&aacute; um bot&atilde;o <b>Atualizar</b> na parte inferior do formul&aacute;rio.  
            A atualiza&ccedil;&atilde;o online permite-lhe encontrar (e usar) informa&ccedil;&atilde;o acerca do seu item utilizando 
			servi&ccedil;os online. Disp&otilde;e de mais explica&ccedil;&otilde;es <a href="../onlinesearch/onlinesearch.html">aqui</a>.
            </td></tr>
    	<tr><td>-</td>
    		<td><b>Gravar</b>: 
            aplica as altera&ccedil;&otilde;es efetuadas e grava o item.
            </td></tr>
    	<tr><td>-</td>
    		<td><b>Apagar</b>: 
            apaga o item, ap&oacute;s o que j&aacute; n&atilde;o ser&aacute; encontrado. Esta a&ccedil;&atilde;o n&atilde;o pode ser desfeita. 
			O Data Crow pede-lhe confirma&ccedil;&atilde;o antes de apagar o item.
            </td></tr>
    	<tr><td>-</td>
    		<td><b>Fechar</b>: 
            fecha o formul&aacute;rio e descarta todas as altera&ccedil;&otilde;es efetuadas. Alternativamente, pode usar a tecla <b>Esc</b>.
            </td></tr>
	</table>
    
    <h2>Menu Ficheiro</h2>
    
    <table cellspacing="2" cellpadding="2" border="0">
        <tr><td>-</td>
        <td><b>Ler informa&ccedil;&atilde;o do ficheiro</b>: 
        para ler informa&ccedil;&atilde;o de um ficheiro de filme, de m&uacute;sica, etc., v&aacute; ao menu <b>Ficheiro</b> e selecione 
        <b>Ler informa&ccedil;&atilde;o do ficheiro</b>.<br>
        Se o item j&aacute; tiver um nome de ficheiro definido, a informa&ccedil;&atilde;o desse ficheiro volta a ser lida. 
        Sen&atilde;o, &eacute; aberto um di&aacute;logo que lhe permite procurar o ficheiro de onde quer ler a informa&ccedil;&atilde;o. 
        O Data Crow vai ler a informa&ccedil;&atilde;o do ficheiro e atualizar os valores no formul&aacute;rio de item.        
        </td></tr>
    	<tr><td>-</td>
        <td><b>Fechar</b>: 
        fecha o formul&aacute;rio e descarta todas as altera&ccedil;&otilde;es efetuadas. Alternativamente, pode usar a tecla <b>Esc</b>
        </td></tr>        
    </table>
    
    <h2>Desenho do formul&aacute;rio de item</h2>
    O formul&aacute;rio de item est&aacute; dividido em separadores. Estes podem conter um ou mais campos importantes. 
    
    <br><br><img src="./images/itemform_tabs_pt.png" alt="" border="0"><br><br>
    
    <br><br>
    <b>Nota:</b> pode modificar o desenho do formul&aacute;rio usando as 
	<a href="../settings/itemformsettings.html">Defini&ccedil;&otilde;es do formul&aacute;rio de item</a>.
    
    <h2>Introduzir informa&ccedil;&atilde;o</h2>
    Esta sec&ccedil;&atilde;o explica os v&aacute;rios tipos de campos que pode encontrar ao introduzir informa&ccedil;&atilde;o.
    
    <h3>Campo de texto</h3>
    Num campo de texto, como mostrado abaixo, pode introduzir qualquer tipo de texto. 
    
    <br><br><img src="./images/itemform_fields_text_pt.png" alt="" border="0"><br><br>
    
    H&aacute; tamb&eacute;m campos de texto longo, como por exemplo o campo <i>Descri&ccedil;&atilde;o</i>, mostrado abaixo:
    
    <br><br><img src="./images/itemform_fields_textlong_pt.png" alt="" border="0"><br>
    
    A barra de deslocamento &agrave; direita pde ser usada para se deslocar para cima e para baixo no texto.<br><br>
    
    Para ver ainda melhor o texto, fa&ccedil;a duplo clique em qualquer s&iacute;tio do campo e abre um di&aacute;logo separado:
    
    <br><br><img src="./images/itemform_fields_textlong_zoom_pt.png" alt="" border="0"><br><br>
    
    Este di&aacute;logo pode ser ampliado, claro, e pode ser usado para ver e/ou editar o texto de forma mais conveniente.
    
    <h3>Campo num&eacute;rico</h3>
    Num campo num&eacute;rico s&oacute; pode introduzir n&uacute;meros (sem casas decimais).
    
    <br><br><img src="./images/itemform_fields_number_pt.png" alt="" border="0">
    
    <h3>Lista pendente</h3>
    A lista pendente cont&eacute;m valores predefinidos que podem ser atribu&iacute;dos a um item. Simplesmente selecione o valor
	da lista.
    
    <br><br><img src="./images/itemform_dropdown_pt.png" alt="" border="0"><br><br>
    
    No caso de lhe faltar um item na lista, pode cri&aacute;-lo. Para adicionar um novo item &agrave; lista clique em 
    <img src="./images/itemform_dropdown_add_pt.png" alt="" border="0">. Vai abrir um novo formul&aacute;rio de item
    onde pode introduzir os valores. Clique em <b>Gravar</b> quando estiver satisfeito e o item ser&aacute; adicionado &agrave; lista pendente.

    <h3>Campo multirefer&ecirc;ncia</h3>

    Este campo &eacute; explicado <a href="../items/itemform_multireference.html">aqui</a>.

    <h3>Campo Ficheiro</h3>
    Aqui pode criar uma liga&ccedil;&atilde;o a um ficheiro no sistema. Clique em 
	<img src="./images/itemform_fields_multi_reference_open_pt.png" alt="" border="0"> para procurar o ficheiro a que quer ligar este item.
    
    <br><br><img src="./images/itemform_fields_file_field_pt.png" alt="" border="0"><br><br>
    
    Um ficheiro pode ser aberto/iniciado clicando em <img src="./images/itemform_fields_file_field_launch_pt.png" alt="" border="0">.

	<h3>Imagens</h3>
    Cada imagem de um item &eacute; mostrada num separador diferente. 
    
    <br><br><img src="./images/itemform_pictures_pt.png" alt="" border="0"><br><br>
    
    As imagens podem ser exportadas, editadas, adicionadas, apagadas ou substitu&iacute;das nestes separadores. 
    Para adicionar ou substituir uma imagem selecione, por exemplo, <b>Adicionar de ficheiro</b> no menu <b>Ficheiro</b> e procure a
	imagem espec&iacute;fica. Para gravar a imagem no disco selecione <b>Gravar como</b>. <br>
    Atrav&eacute;s do menu <b>Editar</b> uma imagem pode ser editada ou apagada. H&aacute; v&aacute;rias op&ccedil;&otilde;es de 
	edi&ccedil;&atilde;o, como rodar ou focar.

    <h2>M&oacute;dulos-filho</h2>
    No caso de o m&oacute;dulo ter m&oacute;dulos-filho, por exemplo o m&oacute;dulo CDs de &aacute;udio, pode criar filhos para estes itens.
    
    <br><br><img src="./images/itemform_children_pt.png" alt="" border="0"><br><br>
    
    <h3>Criar m&uacute;ltiplos</h3>
    Se quiser criar m&uacute;ltiplos itens em simult&acirc;neo, clique em <b>Criar m&uacute;ltiplos</b>.

    <br><br><img src="./images/administration_createmultiple_pt.png " alt="" border="0"><br><br>
    
    Para adicionar uma linha a este resumo clique em <b>Adicionar</b>. Clique na linha e comece a escrever. Quando tiver introduzido a 
    informa&ccedil;&atilde;o para todas as linhas adicionadas clique em <b>Gravar</b>.
    Os seus itens est&atilde;o criados!  

    <h3>Abrir um item</h3>
    Fa&ccedil;a duplo clique num item para abrir o formul&aacute;rio de item. Aqui pode ver e/ou editar o item (dependendo dos seus direitos, 
	definidos em <a href="../security/security.html">Seguran&ccedil;a</a> e 
	<a href="../settings/general.html">Defini&ccedil;&otilde;es gerais</a>). 
    
    <h3>Apagar um item</h3>
    Se clicar num item com o bot&atilde;o direito, pode optar por apagar o item.<br> 

    <h2>Itens relacionados</h2>
    O separador <b>Itens relacionados</b> mostra os itens que t&ecirc;m rela&ccedil;&otilde;es com o item atual. No exemplo abaixo estamos 
	a ver a categoria <i>Jogos de a&ccedil;&atilde;o</i>. Esta categoria foi atribu&iacute;da a um n&uacute;mero de itens, entre os quais 
	Simon the Sorcerer 2. Pode fazer duplo clique no item para o abrir. 
    
    <br><br><img src="./images/itemform_references_pt.png" alt="" border="0"><br><br>
    
    <h2>Gest&atilde;o de empr&eacute;stimos</h2>
    Aqui pode registar um empr&eacute;stimo ou marcar um item como devolvido, tornando-o dispon&iacute;vel para outros empr&eacute;stimos.
    Leia <a href="../loan/loan.html">isto</a> para mais ajuda. Adicionalmente h&aacute; um resumo mostrando todos os empr&eacute;stimos 
    (hist&oacute;ricos inclu&iacute;dos). Pode ser encontrado no menu <b>Gest&atilde;o</b> e &eacute; chamado 
    <a href="../loan/loanadmin.html">Gest&atilde;o de empr&eacute;stimos</a>.

  </body>
</html>
