<html>
  <head>
        <link href="../datacrow_help.css" rel="stylesheet" type="text/css">
  </head>
  <body>
    <h1>Modelos</h1>
    <i>Caminho de menu: Gest&atilde;o &gt; Manter &lt;nome&gt; modelos</i><br><br>
    
    Caso queira atribuir valores predefinidos a itens criados de novo pode defini-los num modelo. Pode encontrar esta funcionalidade no
    menu <b>Gest&atilde;o</b>.

    <br><br><img src="./images/templates_pt.png" alt="" border="0"><br><br>

    Clique em <b>Novo</b> para criar um novo modelo. Abre um <a href="itemform.html" target="main">Formul&aacute;rio de item</a>.
    
    <br><br><img src="./images/template_pt.png" alt="" border="0"><br><br>
    
    Repare que o formul&aacute;rio &eacute; praticamente id&ecirc;ntico ao normal, exceptuando o separador <b>Propriedades do modelo</b>,
    onde encontra os campos <b>Predefini&ccedil;&atilde;o</b> e <b>Nome do modelo</b>. Os campos explicam-se a si pr&oacute;prios. 
    O nome do modelo &eacute; obrigat&oacute;rio e tem de ser &uacute;nico. Preencha os campos que quer usar como predefini&ccedil;&atilde;o
    e clique em <b>Gravar</b>. O modelo est&aacute; pronto a usar!

    <h2>Modelo predefinido</h2>
    Um modelo marcado como predefinido &eacute; sempre usado para criar um novo item. Pode n&atilde;o ter nenhum modelo ou pode ter um modelo.

    <h2>Usar modelos n&atilde;o predefinidos</h2>
    Um modelo predefinido &eacute; sempe usado, mas e se quiser usar um modelo n&atilde;o predefinido? Ap&oacute;s um modelo ter sido definido
    a <a href="../general/menubar.html">barra de menu</a> &eacute; atualizada e o modelo &eacute; tornado dispon&iacute;vel. 
    
    <br><br><img src="./images/templates_use_pt.png" alt="" border="0"><br><br>
    
    V&aacute; ao menu <b>Ficheiro</b>, submenu <b>Novo item</b>. Este submenu cont&eacute;m todos os modelos definidos. Selecione um para 
	criar um novo item usando o modelo.

    <h1>Apagar o modelo</h1>
    Selecione o modelo na lista, clique com o bot&atilde;o direito, selecione <b>Apagar</b> no menu.

    <h1>Atualizar um modelo</h1>
    Fa&ccedil;a duplo clique num item da lista para o abrir. Modifique os valores, o valor predefinido ou o nome do modelo e clique em
    <b>Gravar</b>.

  </body>
</html>
