<html>
  <head>
        <link href="../datacrow_help.css" rel="stylesheet" type="text/css">
  </head>
  <body>

    <h1>Gest&atilde;o de empr&eacute;stimos</h1>
    <i>Caminho de menu: Gest&atilde;o &gt; Gest&atilde;o de empr&eacute;stimos</i><br><br>
    
    A informa&ccedil;&atilde;o de empr&eacute;stimos d&aacute;-lhe um resumo dos itens atualemnte emprestados. Pode procurar 
	por empr&eacute;stimos espec&iacute;ficos usando os campos de filtragem.
    
    <br><br><img src="./images/loan_administration_pt.png" alt="" border="0"><br><br>

    Est&atilde;o dispon&iacute;veis os seguintes campos:<br>

    <table cellspacing="2" cellpadding="2" border="0">
        <tr><td>-</td>
        <td><b>Tipo de empr&eacute;stimos</b>: 
        selecione o tipo de empr&eacute;stimo que quer incluir no resumo. Tem a op&ccedil;&atilde;o de incluir s&oacute; os 
		empr&eacute;stimos atuais, s&oacute; os hist&oacute;ricos ou todos os empr&eacute;stimos.     
        </td></tr>
    	<tr><td>-</td>
        <td><b>Emprestado a</b>: 
        selecione uma pessoa para obter um resumo dos itens emprestados s&oacute; a essa pessoa.
        </td></tr>
    	<tr><td>-</td>
        <td><b>Item</b>: 
        selecione o tipo de item por que quer filtrar (programas, filmes, etc).
        </td></tr>
    	<tr><td>-</td>
        <td><b>S&oacute; devolu&ccedil;&otilde;es tardias</b>: 
        inclui s&oacute; itens devolvidos fora do prazo.
        </td></tr>          
    	<tr><td>-</td>
        <td><b>Data de devolu&ccedil;&atilde;o entre x e y</b>: 
        selecione o intervalo de datas para a devolu&ccedil;&atilde;o. Pode deixar um ou ambos os campos em branco.
        </td></tr>  
    	<tr><td>-</td>
        <td><b>Data inicial entre x e y</b>: 
        selecione o intervalo de datas para o in&iacute;cio do empr&eacute;stimo. Pode deixar um ou ambos os campos em branco.
        </td></tr>  
    </table> <br>  
    
    O resumo mostra os empr&eacute;stimos. Pode fazer duplo clique em qualquer deles pra receber um item ou verificar os detalhes. 
    (<a href="../loan/loan.html" target="main">Mais acerca disto</a>). Clique com o bot&atilde;o direito em qualquer um dos empr&eacute;stimos
	para editar ou rever o item: <br><br>
    
    <img src="./images/loan_administration_rightclick_pt.png" alt="" border="0"><br><br>
    
    &Eacute; mostrada a seguinte informa&ccedil;&atilde;o por empr&eacute;stimo:<br><br>
    
    <img src="./images/loan_administration_overview_pt.png" alt="" border="0"><br><br>
    
    
    <table cellspacing="2" cellpadding="2" border="0">
        <tr><td>-</td>
        <td><b>Item</b>: 
        que tipo de item estamos a ver (programa, CD de &aacute;udio, etc.). 
        </td></tr>
    	<tr><td>-</td>
        <td><b>R&oacute;tulo</b>:
        descri&ccedil;&atilde;o do item.
        </td></tr>
    	<tr><td>-</td>
        <td><b>Emprestado a</b>: 
        quem tem este item emprestado?
        </td></tr>
    	<tr><td>-</td>
        <td><b>Data inicial</b>:
        a data inicial do empr&eacute;stimo.
        </td></tr>
    	<tr><td>-</td>
        <td><b>Data final</b>: 
        a data de devolu&ccedil;&atilde;o. S&oacute; os empr&eacute;stimos hist&oacute;ricos ter&atilde;o um valor aqui.
        </td></tr>
    	<tr><td>-</td>
        <td><b>Data de devolu&ccedil;&atilde;o</b>: 
        quando deve o item ser devolvido? Mostrado a vermelho caso a data j&aacute; tenha sido ultrapassada.
        </td></tr>
    	<tr><td>-</td>
        <td><b>Estado do empr&eacute;stimo</b>: 
        o estado do empr&eacute;stimo, como <i>Prazo expirado</i>, <i>Emprestado</i> e <i>Dispon&iacute;vel</i>.
        </td></tr>
    	<tr><td>-</td>
        <td><b>Dias</b>: 
        n&uacute;mero de dias decorridos durante o atual estado do empr&eacute;stimo.
        </td></tr>        
    </table>  
  </body>
</html>
