<html>
  <head>
        <link href="../datacrow_help.css" rel="stylesheet" type="text/css">
  </head>
  <body>
    
    <h1>Defini&ccedil;&otilde;es gerais de campos</h1>
    <i>Caminho de menu: Defini&ccedil;&otilde;es &gt; Defini&ccedil;&otilde;es gerais de campos</i><br><br>
    
    Usando as defini&ccedil;&otilde;es gerais de campos, as propriedades de cada um dos campos podem ser alteradas. 

	<br><img src="./images/fields_pt.png" alt="" border="0"><br><br>
	
    <h2>Renomear um campo</h2>
    O r&oacute;tulo de cada campo pode ser renomeado. O nome original &eacute; mostrado &agrave; esquerda. Este 
	&eacute; o valor predefinido. Pode introduzir um novo valo na coluna <i>Personalizado</i>. Clique em <b>Gravar</b> 
	para aplicar as altera&ccedil;&otilde;es.

    <h2>Marcar um campo como requerido</h2>
    Pode marcar um campo como requerido. Ao gravar, este campo tem obrigatoriamente que estar preenchido. 
	O item s&oacute; &eacute; gravado quando todos os campos requeridos estiverem preenchidos.

    <h2>Ativo</h2>
    Definir um campo como inativo, n&atilde;o s&oacute; o oculta mas tamb&eacute;m impede o Data Crow de usar o campo. 
    Note que h&aacute; um campo para o qual esta op&ccedil;&atilde;o &eacute; completamente ignorada, nomeadamente, o campo ID.

    <h2>Descritivo?</h2>
    Quando um campo (ou uma combina&ccedil;&atilde;o de v&aacute;rios campos) est&aacute; marcado como descritivo, o valor neste 
	campo &eacute; usado para representar os itens.

    <h2>Chave</h2>
    A combina&ccedil;&atilde;o dos campos chave ser&aacute; usada para verificar se os itens j&aacute; existem. 
	Leia <a href="../settings/general.html">(mais acerca disto)</a>.

    <h2>Adicionar os seus pr&oacute;prios campos</h2>
    H&aacute; cinco campos predefinidos como inativos.  S&atilde;o dois campos de texto curto, um campo de texto longo (mais de 
	4000 carateres) e dois campos num&eacute;ricos. Pode ativ&aacute;-los marcando a respetiva caixa. Pode renome&aacute;-los 
	&agrave; sua vontade (veja o par&aacute;grafo anterior). N&atilde;o se esque&ccedil;a de os tornar vis&iacute;veis!

  </body>
</html>
