<html>
  <head>
        <link href="../datacrow_help.css" rel="stylesheet" type="text/css">
  </head>
  <body>
  
    <h1>Defini&ccedil;&otilde;es gerais</h1>
    <i>Caminho de menu: Defini&ccedil;&otilde;es &gt; Defini&ccedil;&otilde;es &gt; Defini&ccedil;&otilde;es gerais</i><br><br>

    Esta sec&ccedil;&atilde;o descreve as defini&ccedil;&otilde;es gerais do Data Crow. Estas defini&ccedil;&otilde;es 
	alteram o comportamento fundamental do Data Crow. 
    
	<br><img src="./images/general_pt.png" alt="" border="0"><br><br>
	
    <b>Nota</b>: estas defini&ccedil;&otilde;es s&atilde;o armazenadas por computador; mesmo quando tem m&uacute;ltiplos 
	computadores a usar a mesma pasta de utilizador 
	(veja <a href="../general/starting_datacrow.html">Iniciar o Data Crow</a>) cada computador ter&aacute;
    as suas pr&oacute;prias defini&ccedil;&otilde;es.

    <h2>Abrir itens no modo de edi&ccedil;&atilde;o por predefini&ccedil;&atilde;o</h2>
    Por predefini&ccedil;&atilde;o, o Data Crow abre os itens no modo de edi&ccedil;&atilde;o. Caso desmarque esta caixa, os itens 
	ser&atilde;o abertos no modo de vista. Ainda pode edit&aacute;-los, mas tem de selecionar <b>Editar</b> especificamente na
    <a href="../general/menubar.html">barra de menus</a> ou do <a href="../items/views.html">menu do clique com o bot&atilde;o direito</a>
    na vista.
    
    <h2>Ativar alta qualidade (baixa performance)</h2>
    O Data Crow pode compor imagens em alta qualidade. Por predefini&ccedil;&atilde;o esta op&ccedil;&atilde;o est&aacute; desmarcada por 
	motivo de performance, mas pode experimentar e ver como funciona no seu sistema. S&oacute; afeta a apresenta&ccedil;&atilde;o gr&aacute;fica. N&atilde;o tem efeito na 
	forma como as imagens s&atilde;o gravadas no Data Crow.

	<h2>Verificar a exclusividade dos valores ao gravar</h2>
	O Data Crow vai verificar se o item &eacute; &uacute;nico antes de o gravar. A exclusividade &eacute; determinada pelos valores do campo chave 
    (como definido nas <a href="../settings/fields.html">Defini&ccedil;&otilde;es gerais de campos</a>). 
    Se o item n&atilde;o for &uacute;nico, n&atilde;o ser&aacute; gravado e &eacute;-lhe mostrada uma mensagem.<br>
	Esta op&ccedil;&atilde;o est&aacute; marcada por predefini&ccedil;&atilde;o e <b><i><u>n&atilde;o</b></i></u> se recomenda que a desmarque.

	<h2>Verificar campos requeridos</h2>
	Verificar se todos os campos requeridos foram introduzidos. Se n&atilde;o, o item n&atilde;o ser&aacute; gravado na base de dados e o Data Crow 
    mostra uma mensagem evidenciando os campos em falta.
	Esta op&ccedil;&atilde;o est&aacute; marcada por predefini&ccedil;&atilde;o e <b><i><u>n&atilde;o</b></i></u> se recomenda que a desmarque,
	porque pode provocar inconsist&ecirc;ncias nos dados. 
    <br><br>Pode definir os seus pr&oacute;prios campos requeridos nas 
	<a href="../settings/fields.html">Defini&ccedil;&otilde;es gerais de campos</a>.

	<h2>Mostrar sugest&otilde;es para tabelas</h2>
	Ativar ou desativar sugest&otilde;es para valores nas tabelas (ativo por predefini&ccedil;&atilde;o).

	<h2>Apagar ficheiro de imagem depois de o adicionar a um item</h2>
	Apaga a imagem do seu disco depois de a adicionar &agrave; base de dados do Data Crow. Esta op&ccedil;&atilde;o est&aacute; desativada por 
	predefini&ccedil;&atilde;o e <b><i><u>recomenda-se</b></i></u> que assim se mantenha.</td>
	
    <h2>Procurar novas vers&otilde;es no arranque</h2>
    Procura por novas vers&otilde;es do Data Crow (no arranque da aplica&ccedil;&atilde;o). Ativa por predefini&ccedil;&atilde;o.</td>

  </body>
</html>
