<html>
  <head>
        <link href="../datacrow_help.css" rel="stylesheet" type="text/css">
  </head>
  <body>
    
    <h1>Defini&ccedil;&otilde;es do formul&aacute;rio de item</h1>
		<i>Caminho de menu: Defini&ccedil;&otilde;es &gt; Defini&ccedil;&otilde;es do formul&aacute;rio de item</i><br><br>
    
    Este di&aacute;logo permite-lhe gerir os separadores mostrados no <a href="../items/itemform.html">Formul&aacute;rio de item</a>. 
    Por predefini&ccedil;&atilde;o, para a maioria dos m&oacute;dulos, h&aacute; dois separadores: Informa&ccedil;&atilde;o e 
	Informa&ccedil;&atilde;o t&eacute;cnica. 
        
    <h2>Separadores</h2>
    
	<br><br><img src="./images/itemformsettingslabels_pt.png" alt="" border="0"><br>
	
    <h3>Adicionar um separador</h3>
    Aqui pode definir novos separadores ou apagar existentes. Para criar um novo clique em <b>Adicionar</b>. Vai abrir um formul&aacute;rio de item
    onde pode definir o nome e um &iacute;cone para o novo separador. 
    <br><br>
    Clique em <b>Gravar</b> para tornar o separador dispon&iacute;vel.
    
    <h3>Remover um separador</h3>
    Selecione o separador que quer remover na tabela de separadores e clique em <b>Apagar</b>.
    
    <h3>Definir a ordem dos separadores</h3>
    Pode alterar a ordem dos separadores de acordo com as suas necessidades. Clique num separador na tabela e use as setas verdes &agrave; direita 
    na janela para o mover para cima, para baixo, para o in&iacute;cio ou para o fim da lista. Clique em <b>Gravar</b> para aplicar 
	as altera&ccedil;&otilde;es.
    
    <h2>Desenho de tabela</h2>
	
	<br><br><img src="./images/itemformsettingsdesign_pt.png" alt="" border="0"><br>
	
    Os separadores t&ecirc;m de ter campos atribu&iacute;dos para poderem funcionar corretamente. Na lista pendente ao cimo da janela, selecione
    o separador que quer editar. Por baixo, &agrave; esquerda est&atilde;o os campos dispon&iacute;veis e &agrave; direita os campos atualmente 
	usados.
    <br><br>
    Os campos dispon&iacute;veis podem ser adicionados ao separador, os outros j&aacute; lhe est&atilde;o atribu&iacute;dos.
    Fa&ccedil;a clique nos campos para os mudar de lado na janela.
    
    <br><br>
    <b>Nota</b>: caso n&atilde;o haja campos dispon&iacute;veis no lado esquerdo, ter&aacute; primeiro de os remover de algum dos separadores
	na lista pendente.
    
    <h3>Ordem dos campos</h3>
    Clique num campo na tabela e use as setas verdes &agrave; direita 
    na janela para o mover para cima, para baixo, para o in&iacute;cio ou para o fim da lista. Clique em <b>Gravar</b> para aplicar 
	as altera&ccedil;&otilde;es.
    
  </body>
</html>
