<html>
  <head>
        <link href="../datacrow_help.css" rel="stylesheet" type="text/css">
  </head>
  <body>
  
    <h1>Criar um novo m&oacute;dulo</h1>
    <i>Caminho de menu: M&oacute;dulos &gt; Assistente Novo m&oacute;dulo</i><br><br>

	Na janela principal do Data Crow encontra um menu chamado <b>M&oacute;dulos</b>. Este menu cont&eacute;m assistentes 
	para personalizar, criar e relacionar m&oacute;dulos. Neste cap&iacute;tulo vamos mergulhar na cria&ccedil;&atilde;o do seu 
	pr&oacute;prio m&oacute;dulo.
		
	<br><br><img src="./images/module_create_pt.png">
	
	<h2>Iniciar o assistente</h2>
	Inicie o assistente selecionando <b>Assistente Criar m&oacute;dulo</b> no menu <b>M&oacute;dulos</b>.
	
	<h2>Selecionar o tipo de m&oacute;dulo</h2>
	H&aacute; quatro tipos de m&oacute;dulo &agrave; escolha; propriedade, multim&eacute;dia, outro e pessoas.
	
	<br><br><img src="./images/module_create_type_pt.png">
	
	<h3>M&oacute;dulos de propriedade</h3>
	Este &eacute; um m&oacute;dulo muito simples. Tem dois campos importantes predefinididos: "nome" e "&iacute;cone". 
	Este m&oacute;dulo &eacute; usado por outros m&oacute;dulos para criar itens de propriedade como g&eacute;neros, categorias, 
	meios de armazenamento, etc. Poder&aacute; ler mais sobre isto quando come&ccedil;ar a definir campos para o seu m&oacute;dulo.
	
	<h3>M&oacute;dulos multim&eacute;dia</h3>
	Este tipo de m&oacute;dulo &eacute; muito comum no Data Crow. Programas, CDs de &aacute;udio e Filmes s&atilde;o exemplosde 
	m&oacute;dulos multim&eacute;dia. Este tipo de m&oacute;dulo tem um conjunto predefinido de campos comum a todos os tipos de 
	multim&eacute;dia: t&iacute;tulo, descri&ccedil;&atilde;o, ano, localiza&ccedil;&atilde;o, classifica&ccedil;&atilde;o e utilizador.
	
	<h3>Outros m&oacute;dulos</h3>
	Se nenhum dos acima lhe serve, escolha este tipo de m&oacute;dulo. N&atilde;o tem campos predefinidos (exceto o campo ID, 
	que &eacute; obrigat&oacute;rio para todos os m&oacute;dulos), tornando-o o perfeito candidato para criar um m&oacute;dulo de ra&iacute;z.
    
    <h3>M&oacute;dulos de pessoas</h3>
    Quer um m&oacute;dulo representando pesoas? Campos predefinidos: nome, nome pr&oacute;prio, apelido, fotografia, p&aacute;gina web.
    
    <h2>Preencher a informa&ccedil;&atilde;o b&aacute;sica</h2>
    Neste passo vai dar nome ao m&oacute;dulo e aos seus itens, selecionar os &iacute;cones e introduzir uma descri&ccedil;&atilde;o. 
	Os nomes do m&oacute;dulo e seus itens n&atilde;o podem ser alterados, portanto escolha com cuidado. <br>
    <table cellspacing="2" cellpadding="2" border="0">
    	<tr><td>-</td>
    		<td><b>Descri&ccedil;&atilde;o</b>: uma descri&ccedil;&atilde;o gen&eacute;rica do m&oacute;dulo, mostrada na barra de 
			m&oacute;dulos ao passar o rato por cima.</td></tr>
    	<tr><td>-</td>
    		<td><b>Nome do m&oacute;dulo</b>: o nome do m&oacute;dulo, por exemplo, <i>Filmes</i>.</td></tr>
    	<tr><td>-</td>
    		<td><b>Nome do item</b>: o nome dos itens do m&oacute;dulo, por exemplo, <i>Filme</i>.</td></tr>
    	<tr><td>-</td>
    		<td><b>Plural dos itens</b>: o plural do nome de item, por exemplo, <i>Filmes</i>.</td></tr>
	</table>
	<br><br>
    
    Clique nos &iacute;cones para os alterar. O maior &eacute; usado na barra de m&oacute;dulos (lado esquerdo da janela), 
	o mais pequeno em toda a aplica&ccedil;&atilde;o. 
    <br><br>
    
    Est&atilde;o dispon&iacute;veis as seguintes  op&ccedil;&otilde;es (note que as op&ccedil;&otilde;es variam de m&oacute;dulo para m&oacute;dulo):
    <table cellspacing="2" cellpadding="2" border="0">
    	<tr><td>-</td>
    		<td><b>Os items podem ser atribu&iacute;dos a um contentor</b>: ativar esta op&ccedil;&atilde;o torna dispon&iacute;vel uma lista 
			pendente de contentores	para os itens do m&oacute;dulo, o que permite armazenar os itens em contentores. Um contentor pode ser uma 
			estante, uma caixa de CDs ou at&eacute; mesmo uma casa e respetivas divis&otilde;es.</td></tr>
    	<tr><td>-</td>
    		<td><b>Os itens representam ficheiros reais</b>: se ativada s&atilde;o adicionados campos de ficheiro aos itens do m&oacute;dulo,
			tornando poss&iacute;vel que os seus itens representem ficheiros no sistema.</td></tr>
    	<tr><td>-</td>
    		<td><b>Os itens podem ser emprestados a outras pessoas</b>: pode indicar se os itens do m&oacute;dulo podem ser emprestados a 
			outras pessoas (n&atilde;o dispon&iacute;vel para m&oacute;dulos de propriedade). Ativar esta op&ccedil;&atilde;o disponibiliza a 
			funcionalidade de <i>empr&eacute;stimos</i>. Pode alterar esta informa&ccedil;&atilde;o mais tarde 
			(<a href="altermodulewizard.html">Assistente Alterar m&oacute;dulo</a>).</td></tr>
	</table>

	<h1>Definir campos</h1>
    Veja <a href="definingfields.html">"Definir campos"</a>.
    
    <h1>Terminar o assistente</h1>
    Ap&oacute;s ter fornecido toda a informa&ccedil;&atilde;o clique em <b>Terminar</b> ou em <b>Terminar &amp; novo</b>. O primeiro
	termina o processo de cria&ccedil;&atilde;o de m&oacute;dulo (tem de reiniciar o Data Crow antes de poder usar o m&oacute;dulo). 
	O segundo termina o processo de cria&ccedil;&atilde;o de m&oacute;dulo e reinicia o assistente (o que pode ser &uacute;til quando 
	quer criar mais do que um m&oacute;dulo).

  </body>
</html>
