<html>
  <head>
        <link href="../datacrow_help.css" rel="stylesheet" type="text/css">
  </head>
  <body>

    <h1>Exportar um m&oacute;dulo</h1>
    <i>Caminho de menu: M&oacute;dulos &gt; Assistente Exportar m&oacute;dulo</i><br><br>

    Se criou um novo m&oacute;dulo e quer partilh&aacute;-lo com outros utilizadores, pode usar o assistente <b>Exportar m&oacute;dulo</b>.

    Este assistente pode ser encontrado no menu <b>M&oacute;dulos</b>.
    No primeiro passo seleciona qual o m&oacute;dulo que quer exportar. No segundo passo configura o processo de exporta&ccedil;&atilde;o.
    O &uacute;ltimo passo &eacute; a exporta&ccedil;&atilde;o efetiva.

    <h2>&Eacute; exportado o seguinte</h2>
    
    <table cellspacing="2" cellpadding="2" border="0">
        <tr><td>-</td>
        <td>O m&oacute;dulo principal (personalizado).</td></tr>
        <tr><td>-</td>
        <td>Os m&oacute;dulos relacionados.</td></tr>
        <tr><td>-</td>
        <td>Relat&oacute;rios que criou (scripts XSLT, localizados na pasta de relat&oacute;rios do Data Crow).</td></tr>        
        <tr><td>-</td>
        <td>Defini&ccedil;&otilde;es: todas as defini&ccedil;&otilde;es que fez para os m&oacute;dulos espec&iacute;ficos s&atilde;o 
		exportadas e usadas como predefini&ccedil;&otilde;es.</td></tr>    
        <tr><td>-</td>
        <td>Opcionalmente, pode exportar os itens dos m&oacute;dulos principal e relacionados.</td></tr>    
    </table>  

	<h2>Op&ccedil;&otilde;es</h2>
	
	<table cellspacing="2" cellpadding="2" border="0">
        <tr><td>-</td>
        <td><b>Exportar os itens do m&oacute;dulo principal</b>: 
          o m&oacute;dulo principal &eacute; o m&oacute;dulo que selecionou no primeiro passo deste assistente. Marque esta caixa caso queira
		  distribuir, n&atilde;o s&oacute; a defini&ccedil;&atilde;o do m&oacute;dulo, mas tamb&eacute;m os itens que criou no m&oacute;dulo.
        </td></tr>
        <tr><td>-</td>
        <td><b>Exportar os itens dos m&oacute;dulos relacionados</b>: 
          m&oacute;dulos relacionados s&atilde;o todos os m&oacute;dulos que pertencem ou est&atilde;o relacionados com o m&oacute;dulo principal. 
		  Um m&oacute;dulo relacionado poderia ser, por exemplo, um m&oacute;dulo de categoria. Mesmo se escolheu n&atilde;o exportar os itens do 
		  m&oacute;dulo principal, pode ser ben&eacute;fico exportar os itens dos m&oacute;dulos relacionados. D&aacute; a oportunidade a outros 
		  utilizadores de preencher o m&oacute;dulo principal com os seus pr&oacute;prios itens ao mesmo tempo que utilizam propriedades criadas 
		  por si.
        </td></tr>
    </table>  

    <h2>Limita&ccedil;&atilde;o</h2>
    
        <table>
        <tr><td>-</td>
        <td>
        M&oacute;dulos predefinidos, como <i>Programas</i>, n&atilde;o podem ser exportados. O asistente &eacute; s&oacute; para m&oacute;dulos personalizados
        (criados com o <a href="./createmodulewizard.html">Assistente Criar m&oacute;dulo</a>).  
        </td></tr>
        <tr><td>-</td>
        <td>
        S&oacute; pode exportar m&oacute;dulos de n&iacute;vel superior. Os m&oacute;dulos relacionados com este m&oacute;dulo tamb&eacute;m 
		ser&atilde;o exportados. Um m&oacute;dulo de n&iacute;vel superior &eacute; um m&oacute;dulo mostrado no painel de m&oacute;dulos, 
		como por exemplo <i>Programas</i> ou <i>Filmes</i>.
        </td></tr>
    </table>
  </body>
</html>
