<html>
  <head>
        <link href="../datacrow_help.css" rel="stylesheet" type="text/css">
  </head>

  <body>

    <h1>C&oacute;pia &amp; Restauro de seguran&ccedil;as</h1>
    <i>Caminho de menu: Ferramentas &gt; C&oacute;pia &amp; Restauro de seguran&ccedil;as</i><br><br>
    
    &Agrave; medida que a sua cole&ccedil;&atilde;o cresce e cresce, &eacute; uma boa ideia fazer uma c&oacute;pia de seguran&ccedil;a dos seus dados. 
    
    <br><br><img src="./images/backuprestore_pt.png" /> <br><br>
    
    Imagine-se a ter de reintroduzir toda a informa&ccedil;&atilde;o que perdeu ap&oacute;s um ataque de v&iacute;rus, uma avaria no disco ou... ! 
    Fa&ccedil;a c&oacute;pias de seguran&ccedil;a frequentemente e grave-as, no m&iacute;nimo, num disco diferente do seu computador, mas, 
	de prefer&ecirc;ncia num disco externo.

    <h2>Criar uma c&oacute;pia de seguran&ccedil;a</h2>
    Selecione uma pasta destino onde o Data Crow possa escrever a sua c&oacute;pia e clique em <b>C&oacute;pia/Seguran&ccedil;a</b>. Uma vez 
	feitas as defini&ccedil;&otilde;es, os m&oacute;dulos, as imagens e a base de dados foram copiados para uma seguran&ccedil;a!

    <h2>Restaurar uma seguran&ccedil;a</h2>
    Primeiro tem de indicar o que deve ser restaurado da seguran&ccedil;a. Na maioria dos casos, ser&aacute; suficiente restaurar s&oacute; a base
	de dados. Opcionalmente, pode restaurar m&oacute;dulos e modelos de relat&oacute;rio. Isto s&oacute; &eacute; necess&aacute;rio quando a 
	c&oacute;pia cont&eacute;m m&oacute;dulos e/ou relat&oacute;rios personalizados ou modificados. 
    <br><br>
    Para restaurar uma seguran&ccedil;a, navegue at&eacute; ao ficheiro da c&oacute;pia de seguran&ccedil;a e clique em <b>Restaurar</b>. 
	O Data Crow restaura a base de dados (substituindo a atual!) e as suas imagens e defini&ccedil;&otilde;es. Ap&oacute;s terminar o restauro, 
	o Data Crow est&aacute; pronto a funcionar com a sua base de dados restaurada, usando as defini&ccedil;&otilde;es restauradas.

  </body>
</html>
