<html>
  <head>
        <link href="../datacrow_help.css" rel="stylesheet" type="text/css">
  </head>

<body>

	<h1>Renomear ficheiros <i>&lt;nome&gt;</i></h1>
	<i>Caminho de menu: Ferramentas &gt; Renomear ficheiros <i>&lt;nome&gt;</i></i><br><br>
	
    Com esta ferramenta pode renomer ou mover ficheiros, usando a informa&ccedil;&atilde;o introduzida no Data Crow.<br>
    Os ficheiros s&atilde;o renomeados usando um padr&atilde;o. Um padr&atilde;o &eacute; um pequeno script, feito de etiquetas que s&atilde;o
    substitu&iacute;das por valores reais quando usadas &amp; aplicadas. 

    <br><br><img src="./images/filerenamer_pt.png" alt="" border="0"><br><br>
    
    <h2>Defini&ccedil;&otilde;es</h2>
    Nas defini&ccedil;&otilde;es pode indicar quais os itens cujos ficheriros devem ser renomeados.
    
    <br><br><img src="./images/filerenamer_which_pt.png" alt="" border="0"><br><br>
    
    <table cellspacing="2" cellpadding="2" border="0">
        <tr><td>-</td>
            <td>Todos os itens atualmente mostrados</td></tr>
        <tr><td>-</td>
            <td>S&oacute; os itens selecionados</td></tr>
    </table> 
    
    <h2>Padr&atilde;o</h2>
    O campo <b>Padr&atilde;o</b> &eacute; onde o novo caminho e nome de ficheiro s&atilde;o determinados.
    
    <br><br><img src="./images/filerenamer_pattern_pt.png" alt="" border="0"><br><br>
    
    Este campo permite-lhe criar um padr&atilde;o v&aacute;lido usando o menu emergente do clique com o bot&atilde;o direito. Tem quatro 
	op&ccedil;&otilde;es, explicadas abaixo.
    
    <br><br><img src="./images/filerenamer_menu_pt.png" alt="" border="0"><br>
    
    <h3>Inserir texto</h3>
    Selecionar esta op&ccedil;&atilde;o abre um pequeno di&aacute;logo onde pode introduzir um texto. Por predefini&ccedil;&atilde;o, 
	nenhum dos carateres que podem tornar um nome de ficheiro inv&aacute;lido, tal como ':', &eacute; permitido. O texto &eacute; usado 
	tal como est&aacute;, quando o padr&atilde;o for aplicado.

	<h3>Inserir campo</h3>
	Selecione o campo a inserir. Vai notar que este texto &eacute; inserido: [&lt;nomedecampo&gt;].
	Esta "etiqueta" ser&aacute; substitu&iacute;da pelo valor real do campo quando o padr&atilde;o for aplicado.

	<h3>Inserir pasta</h3>
	Insere uma barra "\", indicando que deve ser criada uma nova pasta. Tudo o que est&aacute; antes da barra &eacute; agora parte da 
	estrutura de pastas, em vez do nome de ficheiro.

	<h3>Remover</h3>
	Remove a parte selecionada do padr&atilde;o.
    
    <h2>Gravar um padr&atilde;o</h2>
    A lista pendente <b>Padr&otilde;es existentes</b> mostra padr&otilde;es gravados. Para adicionar um padr&atilde;o &agrave; lista, clique em 
    <img src="../general/images/tb_save_pt.png">. 
    
    
    <h2>Gerir padr&otilde;es gravados</h2>
    O bot&atilde;o <img src="../general/images/tb_delete_pt.png"> remove o filtro atualmente selecionado existente e  
    o bot&atilde;o <img src="../general/images/accept_pt.png"> aplica o filtro atualmente selecionado existente. 

    
    <h2>Configura&ccedil;&atilde;o do caminho</h2>
	
	<h3>Usar localiza&ccedil;&atilde;o original</h3>
	Esta &eacute; a op&ccedil;&atilde;o predefinida. Os ficheiros ser&atilde;o renomeados dentro da sua localiza&ccedil;&atilde;o atual. 
	Se o padr&atilde;o contiver uma estrutura de pastas, o ficheiro ser&aacute; movido relativamente &agrave; sua localiza&ccedil;&atilde;o atual.
	
	<h3>Usar localiza&ccedil;&atilde;o alternativa</h3>
	Pode tamb&eacute;m escolher mover o ficheiro para outra localiza&ccedil;&atilde;o. &Eacute; uma op&ccedil;&atilde;o simp&aacute;tica se tiver, 
	por exemplo, ficheiros MP3 espalhados por v&aacute;rias unidades e quiser junt&aacute;-los todos na mesma localiza&ccedil;&atilde;o.

		
	<h1>Renomear os seus ficheiros</h1>
	
	Ap&oacute;s ter criado um padr&atilde;o, clique em <b>Iniciar</b> para come&ccedil;ar a renomear os eu ficheiros. 
	
	<h2>Pr&eacute;-visualiza&ccedil;&atilde;o</h2>
	Para sua conveni&ecirc;ncia, o Data Crow mostra-lhe uma pr&eacute;-visualiza&ccedil;&atilde;o dos resultados. O resultado real pode ser 
	diferente, uma vez que o ficheiro a renomear tem de existir. Se n&atilde;o existir, &eacute; simplesmente ignorado.

	<h3>Excluir itens</h3>
	A janela de pr&eacute;-visualiza&ccedil;&atilde;o tamb&eacute;m lhe permite excluir itens. Clique nos itens que quer remover, clique 
	com o bot&atilde;o direito e selecione <b>Remover</b> no menu emergente. Os itens removidos ficam exclu&iacute;dos da tarefa de 
	renomea&ccedil;&atilde;o de ficheiros. 
	
	<h3>Verifcar e continuar</h3>
	Clique em <b>Iniciar</b> para continuar o processo, se a pr&eacute;-visualiza&ccedil;&atilde;o lhe agrada. 
	Clique em <b>Cancelar</b> para parar o processo.
	
	<h2>Parar</h2>
	Pode, em qualquer altura, clicar em <b>Parar</b> para cancelar o processo restante.
    
</body>
</html>