<html>
  <head>
        <link href="../datacrow_help.css" rel="stylesheet" type="text/css">
  </head>
  <body>
    
    <h1>Editor de recursos</h1>
    <i>Caminho de menu: Defini&ccedil;&otilde;es &gt; Editor de recursos</i><br><br>
    
    Pode criar tradu&ccedil;&otilde;es com o editor de recursos. 
    
    <br><br><img src="../settings/images/resource_editor_pt.png" /> <br><br>
    
    H&aacute; v&aacute;rias categorias de recursos, tais como r&oacute;tulos e mensagens. Pode optar por editar um dos idiomas dispon&iacute;veis
    ou criar um idioma completamente novo.
    
    <h2>Encontrar o texto</h2>
    Pode filtrar rapidamente o resumo pelo texto que procura, introduzindo texto no campo de filtragem. A cada tecla premida o resumo &eacute;
    filtrado, mostrando as colunas que cont&ecirc;m o texto que introduziu. Limpar o campo mostra novamente todo o resumo.
    
    <h2>Editar recursos</h2>
    Atualizar um recurso existente &eacute; t&atilde;o simples como escrever um novo valor na tabela (clique no texto e comece a escrever ou 
    prima a tecla F2 para editar).<br>
    Em alternativa, pode usar a funcionalidade <i>Substituir com</i>. Primeiro, escreva no campo de filtragem o texto que quer encontrar. 
    A seguir, escreva o texto de substitui&ccedil;&atilde;o no campo <i>Substituir com</i>. Clique em <img src="../general/images/accept_pt.png">
	para substituir todo o texto.
    N&atilde;o h&aacute; nenhum bot&atilde;o para desfazer, no entanto tem a possibilidade de sair do di&aacute;logo sem gravar 
	(clique em <b>Fechar</b>).<br><br>
    
    Clique em <b>Gravar</b> para gravar as altera&ccedil;&otilde;es que fez.
    
    <h2>Criar um novo idioma</h2>
    Selecione <b>Criar novo idioma</b> no menu <b>Editar</b> do editor de recursos. Introduza o nome do novo idioma e selecione o idioma
    em que vai basear a tradu&ccedil;&atilde;o. Basear  um idioma noutro j&aacute; existente signifca que v&atilde;o ser usados os valores 
	existentes at&eacute; que sejam traduzidos.<br>
    Certifique-se que grava as altera&ccedil;&otilde;es antes de fechar o di&aacute;logo.

  </body>
</html>
