<html>
  <head>
        <link href="../datacrow_help.css" rel="stylesheet" type="text/css">
  </head>
  <body>
    <h1>Procura online</h1>
    <i>Caminho de menu: Ferramentas &gt; Procura online</i><br><br>

	O Data Crow pode poupar-lhe tempo procurando informa&ccedil;&atilde;o sobre um item numa base de dados online, como a Amazon, o IMDB.com, 
	ou a Freedb.

    <br><br><img src="./images/onlinesearch_pt.png" alt="" border="0">

	<h2>Iniciar uma procura</h2>
	A procura online est&aacute; dispon&iacute;vel para o formul&aacute;rio de item (para atualiza r um item existente), na barra de menu e 
	na barra de ferramentas. Antes de encontrar o item que procura, certifique-se que selecionou o servidor correto. Cada servidor
	tem as suas pr&oacute;prias op&ccedil;&otilde;es. Por exemplo, quando escolhe um servidor da Amazon, pode selecionar a 
	localiza&ccedil;&atilde;o que quer usar. O servidor localizado na Alemanha d&aacute;-lhe descri&ccedil;&otilde;es em alem&atilde;o, etc.

	<br><br>

	Por predefini&ccedil;&atilde;o o Data Crow procura palavras-chave. Se houver outros modos de procura dispon&iacute;veis, ser&atilde;o 
	mostrados atr&aacute;s do campo <i>Procurar por</i>. Pode simplesmente selecionar outro modo de procura (por exemplo) ISBN, Amazon ID (ASIN) 
	ou c&oacute;digos de barras.

	<br><br>

	Clique em "Parar" para parar uma procura. A procura &eacute; interrompida e pode iniciar uma nova. 
	Clique em "Limpar" para eliminar os resultados anteriores.

    <h2>Defini&ccedil;&otilde;es</h2>
    H&aacute; v&aacute;rias defini&ccedil;&otilde;es a considerar.<br>

    <h3>Valores a encontrar</h3>
    Ao procurar novos itens pode especificar que valores de campos devem ser procurados. Para isto, clique em "Defini&ccedil;&otilde;es"
	e selecione todos os campos para os quais quer que o Data Crow encontre valores. Ao atualizar um item, existe uma op&ccedil;&atilde;o 
	praticamente id&ecirc;ntica. Desta vez, contudo, seleciona os campos para os quais quer que os valores existentes sejam substitu&iacute;dos 
	(se quiser).

    <h3>Econtrar todos os detalhes na procura inicial (lento)</h3>
    Em vez de procurar o m&iacute;nimo de informa&ccedil;&atilde;o pode optar por procurar por toda a informa&ccedil;&atilde;o de uma s&oacute; vez. 
    Vai atrasar bastante a procura!    

    <h3>Atualizar ou adicionar automaticamente o item quando ocorrer uma coincid&ecirc;ncia perfeita</h3>
    Ao selecionar esta op&ccedil;&atilde;o o Data Crow p&aacute;ra a procura assim que encontrar uma coincid&ecirc;ncia perfeita.

    <h3>Encontrar informa&ccedil;&atilde;o adicional em Pessoas & companhias (lento)</h3>
    O Data Crow pode encontrar (na maioria dos casos) informa&ccedil;&atilde;o adicional sobre pessoas, como atores e companhias, 
	como empresas de programa&ccedil;&atilde;o. Esta op&ccedil;&atilde;o est&aacute; desativada por predefini&ccedil;&atilde;o, 
	uma vez que atrasa bastante a procura online. Assim, as pessoas e companhias s&atilde;o criadas da mesma forma mas sem 
    informa&ccedil;&atilde;o adicional. S&oacute; t&ecirc;m o nome. Se ativar a op&ccedil;&atilde;o, o Data Crow tentar&aacute; 
	encontrar imagens e uma descri&ccedil;&atilde;o. Note que pode, a qualquer altura, atualizar todas as pessoas e companhias,
	usando a funcionalidade "Atualiza&ccedil;&atilde;o em massa" (<a href="../tools/mass_update.html">mais acerca disto</a>) 
	do Data Crow ou uma por uma usando a procura online espec&iacute;fica de cada m&oacute;dulo.

	<h2>Adicionar os resultados ao Data Crow</h2>
	Quando encontrar o resultado que procura, selecione o item ou itens e clique em "Adicionar item". 
    Os itens est&atilde;o agora adicionados &agrave; sua cole&ccedil;&atilde;o!

	<br><br>

	Para atualizar um item existente clique em "Atualizar". Os valores no formul&aacute;rio de item ser&atilde;o atualizados com os
	valores do resultado selecionado. Antes de atualizar, verifique se quer substituir valores existentes. Se quiser, marque a caixa
	"Substituir valores existentes" (desmarcada por predefini&ccedil;&atilde;o). A defini&ccedil;&atilde;o ser&aacute; lembrada.

   </body>
</html>