<html>
<head><link href="../datacrow_help.css" rel="stylesheet" type="text/css"></head>

<body>

    <h1>M&oacute;dulos predefinidos</h1>
    <p>
    O Data Crow vem com um conjunto de m&oacute;dulos predefinidos (dependendo de como instalou o Data Crow).
    Aqui encontra uma breve descri&ccedil;&atilde;o sobre o prop&oacute;sito de cada um destes m&oacute;dulos. Muitos deles t&ecirc;m poderosos 
	<a href="../onlinesearch/onlinesearch.html">servi&ccedil;os online</a> dispon&iacute;veis para encontrar informa&ccedil;&atilde;o sobre os seus itens
    assim como <a href="../tools/fileinformationimport.html"><b>importadores de ficheiros</b></a> para encontrar informa&ccedil;&atilde;o dos ficheiros armazenados 
	no seu sistema ou em fontes externas. Cada um destes m&oacute;dulos tem <a href="../reports/reporting.html">relat&oacute;rios</a> espec&iacute;ficos 
	dispon&iacute;veis. A maioria permite-lhe controlar se um item foi <a href="../loan/loan.html">emprestado</a> a uma pessoa na sua lista. 
	Em resumo, cada um dos m&oacute;dulos predefinidos tem um conjunto alargado de ferramentas dispon&iacute;vel para lhe facilitar a vida.</p>
    
    <br>
    
    <table cellspacing="2" cellpadding="2" border="0">
    	<tr><td><img src="./images/module_software_pt.png"></td>
    		<td><b>M&oacute;dulo Programas</b><br>
            O m&oacute;dulo <b>Programas</b> pode ser usado para registar tanto programas como jogos. H&aacute; v&aacute;rios servi&ccedil;os online dispon&iacute;veis
			para atualizar ou encontrar os seus itens online, como a Amazon e o MobyGames.com. Adicionalmente pode importar a informa&ccedil;&atilde;o de qualquer 
			ficheiro. Al&eacute;m dos programas o Data Crow tamb&eacute;m controla informa&ccedil;&atilde;o sobre programadores e editoras desses programas.            
            </td></tr>
    	<tr><td><img src="./images/module_movie_pt.png"></td>
    		<td><b>M&oacute;dulo Filmes</b><br>
            Permite-lhe registar a sua cole&ccedil;&atilde;o de DVD/Blu-ray e a sua cole&ccedil;&atilde;o de ficheiros de filmes (DIVX, XVID, etc.). Os servi&ccedil;os online,
			como o IMDB.com, s&atilde;o capazes de encontrar informa&ccedil;&atilde;o detalhada sobre o filme, incluindo informa&ccedil;&atilde;o 
			detalhada sobre cada ator e realizador.
            </td></tr>
    	<tr><td><img src="./images/module_image_pt.png"></td>
    		<td><b>M&oacute;dulo Imagens</b><br>
            Com o m&oacute;dulo Imagens pode registar a sua cole&ccedil;&atilde;o de imagens (JPEG, BMP, GIF, etc.). O m&oacute;dulo Imagens n&atilde;o fornece servi&ccedil;os online 
            mas pode extrair informa&ccedil;&atilde;o detalhada dos seus ficheiros de imagem usando o importador de ficheiros.
            </td></tr>
    	<tr><td><img src="./images/module_container_pt.png"></td>
    		<td><b>M&oacute;dulo Contentores</b><br>
			Um contentor &eacute; a localiza&ccedil;&atilde;o f&iacute;sica de um item. Pode representar uma caixa de CD, um arm&aacute;rio, um 
			edif&iacute;cio ou qualquer outra coisa que identifique a localiza&ccedil;&atilde;o de um item. &Eacute; poss&iacute;vel criar uma 
			hierarquia de contentores, por exemplo: Edificio - Andar - Divis&atilde;o - M&oacute;vel - Prateleira. 
            Se suportado pelo m&oacute;dulo, um item pode ser atribu&iacute;do a m&uacute;ltiplos contentores. O m&oacute;dulo Contentores n&atilde;o
			tem importador de ficheiros nem servi&ccedil;os online dispon&iacute;veis.
            </td></tr>
    	<tr><td><img src="./images/module_book_pt.png"></td>
    		<td><b>M&oacute;dulo Livros</b><br>
            O m&oacute;dulo Livros pode ser usado para registar os seus livros e eBooks (PDF). A Amazon, o Bol.com e outros servi&ccedil;os online 
			tornam f&aacute;cil encontrar informa&ccedil;&atilde;o sobre os seus livros. O importador de ficheiros pode importar informa&ccedil;&atilde;o sobre 
			os eBooks. As editoras e os autores s&atilde;o mantidos em m&oacute;dulos separados, tornando poss&iacute;vel armazenar informa&ccedil;&atilde;o
			detalhada sobre cada uma destas pessoas/empresas.
            </td></tr>
    	<tr><td><img src="./images/module_audiocd_pt.png"></td>
    		<td><b>M&oacute;dulo CD de &aacute;udio</b><br>
            Exclusivamente para registar CDs de &aacute;udio. Este m&oacute;dulo tem servi&ccedil;os online dispon&iacute;veis e pode extrair informa&ccedil;&atilde;o
			de um CD inserido (Ferramentas &gt; Encontrar informa&ccedil;&atilde;o do CD). N&atilde;o disp&otilde;e de um importador de ficheiros.
            Al&eacute;m dos pr&oacute;prios CDs de &aacute;udio, este m&oacute;dulo tamb&eacute;m gere os artistas musicais. Estes &uacute;ltimos s&atilde;o 
			partilhados com o m&oacute;dulo &Aacute;lbum de m&uacute;sica.
            </td></tr>
    	<tr><td><img src="./images/module_musicalbum_pt.png"></td>
    		<td><b>M&oacute;dulo &Aacute;lbum de m&uacute;sica</b><br>
            Neste m&oacute;dulo pode registar a sua cole&ccedil;&atilde;o de m&uacute;sica baseada em ficheiros. Tem os mesmos servi&ccedil;os online 
			dispon&iacute;veis que o m&oacute;dulo CD de &aacute;udio. Mas, ao contr&aacute;rio do m&oacute;dulo CD de &aacute;udio, este m&oacute;dulo
			tem dispon&iacute;vel um importador de ficheiros bastante capaz, que pode extrair informa&ccedil;&atilde;o de ficheiros MP3 e outros.
            </td></tr>
    	<tr><td><img src="./images/module_media_pt.png"></td>
    		<td><b>M&oacute;dulo Multim&eacute;dia</b><br>
            O m&oacute;dulo Multim&eacute;dia d&aacute;-lhe acesso a todos os seus itens multim&eacute;dia. Mostra itens de cada um dos m&oacute;dulos 
			multim&eacute;dia, como programas, filmes e CDs de &aacute;udio. Um local conveniente para uma vis&atilde;o geral de toda a sua 
			cole&ccedil;&atilde;o multim&eacute;dia.
            </td></tr>
    	<tr><td><img src="./images/module_person_pt.png"></td>
    		<td><b>M&oacute;dulo Pessoas</b><br>
            Este m&oacute;dulo permite-lhe manter registo dos seus amigos e fam&iacute;lia que levaram itens emprestados. N&atilde;o tem servi&ccedil;os 
			online ou importador de ficheiros dispon&iacute;veis.
            </td></tr>
    	<tr><td><img src="./images/module_user_pt.png"></td>
    		<td><b>M&oacute;dulo Utilizador</b><br>
            Este m&oacute;dulo &eacute; explicado em detalhe no <a href="../security/security.html">cap&iacute;tulo Seguran&ccedil;a</a>. 
			Mant&eacute;m registo dos utilizadores que podem iniciar sess&atilde;o no Data Crow e as suas autoriza&ccedil;&otilde;es.
            </td></tr>
	</table>

    <h2>Alterar um m&oacute;dulo</h2>
    Se falta um campo num destes m&oacute;dulos pode usar o <a href="../modules/altermodulewizard.html">Assistente Alterar m&oacute;dulo</a>. 
    As suas altera&ccedil;&otilde;es ser&atilde;o preservadas, mesmo ao atualizar para uma nova vers&atilde;o.

    <h2>Criar um m&oacute;dulo</h2>
    No caso de querer criar um novo m&oacute;dulo, pode usar o <a href="../modules/createmodulewizard.html">Assistente Criar m&oacute;dulo</a>.

</body>
</html>
