<!DOCTYPE HTML PUBLIC "-//W3C//DTD HTML 4.01 Transitional//EN">

<html>
<head>
    <link href="../datacrow_help.css" rel="stylesheet" type="text/css">
</head>

<body>
    <h1>Painel de agrupamento</h1>

    O painel de agrupamento permite agrupar itens. S&atilde;o suportados dois n&iacute;veis de agrupamento. Isto permite, 
	por exemplo, agrupar por ano e por categoria. Pode desativar o painel de agrupamento no menu Ver ou premindo  a tecla F10.


    <h2>Predefini&ccedil;&atilde;o</h2>
    A &aacute;rvore predefinida permite agrupar por informa&ccedil;&atilde;o de campo. Este &eacute; o agrupamento mais usado, uma vez que permite 
	agrupar itens por ano, categoria ou qualquer outro campo dispon&iacute;vel no m&oacute;dulo em que est&aacute; a trabalhar. Pode agrupar
	por v&aacute;rios campos, criando uma estrutura hier&aacute;rquica. No exemplo abaixo os programas est&atilde;o agrupados por contentor, 
	divis&atilde;o e sec&ccedil;&atilde;o. Como pode agrupar por campos &eacute; explicado no pr&oacute;ximo par&aacute;grafo.

    <br><br><img src="./images/view_groupingpane_pt.png" alt="" border="0">

    <h3>Selecionar campos</h3>
    Do menu "Agrupar por" pode selecionar o campo ou campos pelos quais quer agrupar os itens. 
    Pode usar tantos grupos quantos queira.
    
    <br><br><img src="./images/groupby_pt.png" alt="" border="0"><br><br>
    
    &Agrave; esquerda encontrar&aacute; todos os campos que pode usar para agrupar os itens. &Agrave; direita est&atilde;o os campos 
    atualmente usados.<br><br>
    Clique duas vezes num campo para adicionar um dos "Campos dispon&iacute;veis" ou para remover um dos "Campos selecionados".<br><br>
    Adicionalmente pode alterar as camadas do grupo; se quiser agrupar por "Propor&ccedil;&otilde;es" por exemplo, clique no campo uma vez 
	para o selecionar e use as setas verdes para o mover at&eacute; &agrave; posi&ccedil;&atilde;o desejada. 
    <br>
    Prima <b>Aplicar</b> para ativar o agrupamento selecionado.

    <h3>Expandir ou Colapsar a &aacute;rvore (n&oacute;s)</h3>
    Selecione "Expandir tudo" do menu <b>Editar</b> para expandir rapidamente todos os n&oacute;s da &aacute;rvore. 
	A op&ccedil;&atilde;o "Colapsar tudo" no mesmo menu vai colapsar (dobrar) todos os n&oacute;s da &aacute;rvore.

    <h2>Contentores</h2>
	A &aacute;rvore de contentores s&oacute; &eacute; mostrada no m&uacute;dolo Contentores. Oferece as mesmas op&ccedil;&otilde;es que a 
	&aacute;rvora predefinida. Os contentores podem ter uma hierarquia. Esta &eacute; estabelecida definindo um contentor-m&atilde;e.
    Assim pode definir uma estrutura em que tenha estantes de livros identificadas e atribuir cada estante como m&atilde;e das prateleiras.
    Este &eacute; s&oacute; um exemplo, pode definir a estrutura que quiser! <br><br>
    Como pode ter notado, o contentor tem um menu <b>Ver</b>. Est&atilde;o dispon&iacute;veis as seguintes op&ccedil;&otilde;es:

    <table cellspacing="2" cellpadding="2" border="0">
    	<tr><td>-</td>
        <td><b>Vista plana</b> 
        Mostra todos os contentores numa vista plana, ignorando a hierarquia dos contentores.            
         </td></tr>
    	<tr><td>-</td>
        <td><b>Vista hier&aacute;rquica</b> 
        Mostra todos os contentores com as suas rela&ccedil;&otilde;es.            
        </td></tr>  
        <tr><td>-</td>
        <td><b>Ver contentores</b> 
        Ao clicar num contentor na &aacute;rvore carrega o contentor na descri&ccedil;&atilde;o.            
        </td></tr>
        <tr><td>-</td>
        <td><b>Ver itens</b> 
        Ao clicar num contentor na &aacute;rvore carrega o item atribu&iacute;do ao contentor na descri&ccedil;&atilde;o.            
        </td></tr>          
    </table>
    
    <h2>Estrutura de ficheiros</h2>
    Esta &aacute;rvore representa a estrutura dos ficheiros de itens. &Eacute; uma representa&ccedil;&atilde;o da estrutura das pastas e s&oacute; 
	est&aacute; dispon&iacute;vel para m&oacute;dulos em que os itens podem ter um ficheiro atribu&iacute;do( como um filme, que pode apontar 
	para um ficheiro avi). Os itens sem liga&ccedil;&atilde;o a ficheiros tamb&eacute;m ser&atilde;o exclu&iacute;dos desta estrutura.<br>
    O &iacute;cone no ficheiro indica se ele existe. No exemplo abaixo pode ver como o ficheiro <i>Tomb Raider (2013) Full Walkthrough Part 1 Opening.mp3</i> 
	pode ser encontrado e o ficheiro <i>Tomb Raider (2013) Full Walkthrough Part 1 Opening[1].mp3</i> n&atilde;o pode.

    <br><br><img src="./images/view_groupingpane_files_pt.png" alt="" border="0">


</body>
</html>
