<html>
<head><link href="../datacrow_help.css" rel="stylesheet" type="text/css"></head>

<body>

    <h1>A barra de menu</h1>
    A barra de menu cont&eacute;m liga&ccedil;&otilde;es a todas as funcionalidades do Data Crow. Esta p&aacute;gina de ajuda vai explicar-lhe 
    o significado b&aacute;sico dos menus.

    <h2>Ficheiro</h2>
    Os items podem ser criados, apagados ou abertos. Pode tamb&eacute;m ver eventos ou sair da aplica&ccedil;&atilde;o.
    
    <table>
        <tr><td><img src="./images/tb_wizard_pt.png" alt="" border="0"></td>
        <td><a href="../items/wizard.html">Assistente de item</a>.
        O assistente de item &eacute; uma forma r&aacute;pida de adicionar itens &agrave; base de dados (aparte a importa&ccedil;&atilde;o por 
		ficheiros .csv ou XML). Come&ccedil;a por uma procura online (se o m&oacute;dulo suportar procuras online). 
        Ap&oacute;s o item ser encontrado pode edit&aacute;-lo manualmente no passo seguinte. 
        Quando terminar o assistente, o item &eacute; adicionado &agrave; base de dados.
        </td></tr>
    </table>   
    
    <table>
        <tr><td><img src="./images/tb_add_pt.png" alt="" border="0"></td>
        <td><a href="../items/itemform.html">Novo item &lt;nome&gt;</a>. 
        Com a op&ccedil;&atilde;o de menu <b>Novo item &lt;nome&gt;</b> (o &lt;nome&gt; refere o nome do item, como Filme no m&oacute;dulo Filmes) 
        pode adicionar manualmente um novo item ao Data Crow. Vai abri o <a href="../items/itemform.html">Formul&aacute;rio de item</a>.
        </td></tr>
    </table>
    
    <table>
        <tr><td><img src="./images/tb_open_pt.png" alt="" border="0"></td>
        <td><a href="../items/itemform.html">Abrir item&lt;nome&gt;</a>. 
        Com a op&ccedil;&atilde;o de menu <b>Abrir item &lt;nome&gt;</b> (o &lt;nome&gt; refere o nome do item, como Filme no m&oacute;dulo Filmes) 
        pode abrir o item atualmente selecionado (no resumo) no <a href="../items/itemform.html">Formul&aacute;rio de item</a>. 
        A informa&ccedil;&atilde;o do item n&atilde;o pode ser alterada usando esta op&ccedil;&atilde;o, o item &eacute; aberto como s&oacute; de leitura.
        </td></tr>
    </table>     
    
    <table>
        <tr><td><img src="./images/tb_open_pt.png" alt="" border="0"></td>
        <td><a href="../items/itemform.html">Editar item &lt;nome&gt;</a>.
        Com a op&ccedil;&atilde;o de menu <b>Abrir item &lt;nome&gt;</b> (o &lt;nome&gt; refere o nome do item, como Filme no m&oacute;dulo Filmes) 
        pode abrir o item atualmente selecionado (no resumo) no <a href="../items/itemform.html">Formul&aacute;rio de item</a>. 
        O formul&aacute;rio de item permite-lhe alterar a informa&ccedil;&atilde;o do item.
        </td></tr>
    </table> 
    
    <table>
        <tr><td><img src="./images/tb_saveall_pt.png" alt="" border="0"></td>
        <td><a href="../items/views.html">Gravar tudo</a>.
        A vista Tabela permite-lhe editar os itens diretamente na vista. Para gravar todas as altera&ccedil;&otilde;es que fez pode usar a 
		op&ccedil;&atilde;o de menu <b>Gravar tudo</b>.
        </td></tr>
    </table>
    
    <table>
        <tr><td><img src="./images/tb_delete_pt.png" alt="" border="0"></td>
        <td><a href="../items/views.html">Apagar</a>.
        Apaga todos os itens selecionados (na vista) da base de dados. Esta a&ccedil;&atilde;o n&atilde;o pode ser revertida (a n&atilde;o ser restaurando 
		uma c&oacute;pia de seguran&ccedil;a). O sistema pede-lhe uma confirma&ccedil;&atilde;o da a&ccedil;&atilde;o.
        </td></tr>
    </table>
    
    <table>
        <tr><td><img src="./images/tb_log_pt.png" alt="" border="0"></td>
        <td><a href="../general/log.html">Mostrar di&aacute;rio</a>.
        O di&aacute;rio mostra eventos, coisas que aconteceram no sistema. Se alguma coisa correu mal, o Data Crow vai 
        gravar a mensagem de erro aqui. &Eacute; sempre um bom s&iacute;tio para procurar se tiver problemas. Tamb&eacute;m mostra mensagens 
		informativas , "Fiz isto aqui a esta hora".<br>
        O separador de informa&ccedil;&atilde;o de sistema mostra informa&ccedil;&atilde;o adicional. Que pastas est&atilde;o a ser usadas, quais os 
		recursos dispon&iacute;veis, qual a vers&atilde;o Java, etc.
        </td></tr>
    </table> 
    
    <table>
        <tr><td><img src="./images/tb_exit_pt.png" alt="" border="0"></td>
        <td><a href="#">Sair</a>.
        Sai da aplica&ccedil;&atilde;o. 
        </td></tr>
    </table>      
    
    <h2>Administra&ccedil;&atilde;o</h2>
    
    <table>
        <tr><td><img src="./images/tb_administration_pt.png" alt="" border="0"></td>
        <td><a href="../items/administration.html">Manuten&ccedil;&atilde;o</a>. 
        A maioria dos m&oacute;dulos usa listas pendentes ou campos multirefer&ecirc;ncia. Um exemplo seria o campo Estado 
        dos programas. Este campo Estado tem um conjunto predefinido de valores. Pode modificar a lista, completamente.
        A administra&ccedil;&atilde;o destes itens (itens de propriedade, parte do m&oacute;dulo de propriedade), pode ser feita atrav&eacute;s 
		do menu <b>Administra&ccedil;&atilde;o</b>.
        </td></tr>
        <tr><td><img src="./images/tb_loan_pt.png" alt="" border="0"></td>
        <td><a href="../loan/loanadmin.html">Administra&ccedil;&atilde;o de empr&eacute;stimos</a>. 
        Este resumo d&aacute;-lhe uma imagem global dos seus empr&eacute;stimos atuais, hist&oacute;rico dos empr&eacute;stimos 
		e itens com a devolu&ccedil;&atilde;o em falta. Tem op&ccedil;&otilde;es de procura bastante poderosas com as quais pode trabalhar.
        </td></tr>        
    </table>

    <h2>N&iacute;vel de experi&ecirc;ncia</h2>
    <table>
        <tr><td><img src="./images/tb_beginner_pt.png" alt="" border="0"></td>
        <td><a href="#">Principiante</a>. 
        Isto ativa o Data Crow para o modo <i>Principiante</i>, ocultando muitas das op&ccedil;&otilde;es de v&aacute;rios menus.
        </td></tr>
        <tr><td><img src="./images/tb_expert_pt.png" alt="" border="0"></td>
        <td><a href="#">Perito</a>. 
        Isto ativa o Data Crow para o modo <i>Perito</i>, dando acesso a todas as ferramentas e op&ccedil;&otilde;es.
        </td></tr>        
    </table>

    <h2>M&oacute;dulos</h2>
    
    <table>
        <tr><td><img src="./images/tb_wizard_pt.png" alt="" border="0"></td>
        <td><a href="../modules/createmodulewizard.html">Assistente Criar m&oacute;dulo</a>. 
        Permite-lhe criar um novo m&oacute;dulo. &Eacute; uma ferramenta poderosa, permitindo-lhe desenhar a sua pr&oacute;pria gest&atilde;o de 
		cole&ccedil;&otilde;es de dentro da aplica&ccedil;&atilde;o. Os items gravados por estes m&oacute;dulos s&atilde;o gravados na base de dados, tal 
        como &eacute; feito como os m&oacute;dulos predefinidos. Ter&aacute; muitas das ferramentas padr&atilde;o &agrave; sua disposi&ccedil;&atilde;o 
		ao gerir os seus itens. H&aacute; um manual espec&iacute;fico, dispon&iacute;vel para transferir na nossa
		<a href="http://www.datacrow.net/">p&aacute;gina Web</a>.
        </td></tr>
        <tr><td><img src="./images/tb_wizard_pt.png" alt="" border="0"></td>
        <td><a href="../modules/copymodulewizard.html">Assistente Copiar m&oacute;dulo</a>.  
        Este assistente permite-lhe criar um novo m&oacute;dulo baseado noutro j&aacute; existente. Evita-lhe ter de definir
		todos os campos um por um, quando j&aacute; existe um m&oacute;dulo que quase satisfaz as suas necessidades.
        </td></tr>            
        <tr><td><img src="./images/tb_wizard_pt.png" alt="" border="0"></td>
        <td><a href="../modules/altermodulewizard.html">Assistente Alterar m&oacute;dulo</a>.  
        No caso de querer de querer adicionar um campo a um dos m&oacute;dulos existentes pode usar este assistente. Esta poderosa ferramenta
		permite-lhe alterar campos existentes ou adicionar novos campos. Adicionalmente, pode modificar algumas das defini&ccedil;&otilde;es 
		(indicar se itens deste m&oacute;dulo podem ser emprestados a outras pessoas por exemplo).
        </td></tr>   
        <tr><td><img src="./images/tb_wizard_pt.png" alt="" border="0"></td>
        <td><a href="../modules/relatemodulewizard.html">Assistente Rela&ccedil;&otilde;es entre m&oacute;dulos</a>.  
        Uma ferramenta que lhe permite criar rela&ccedil;&otilde;es m&atilde;e-filho entre m&oacute;dulos. Pode encontrar um exemplo destas 
		rela&amp;ccedil;&amp;otilde;es no m&amp;oacute;dulo CDs de &aacute;udio. Este m&oacute;dulo &eacute; m&atilde;e do m&oacute;dulo de 
		faixas do CD. Isto significa que n&atilde;o pode haver faixas de CD sem haver um CD de &aacute;udio. N&atilde;o h&aacute; forma de
		remover esta rela&ccedil;&atilde;o; tenha cuidado ao usar esta ferramenta!
        </td></tr>   
        <tr><td><img src="./images/tb_wizard_pt.png" alt="" border="0"></td>
        <td><a href="../modules/deletemodulewizard.html">Assistente Apagar m&oacute;dulo personalizado</a>.  
        Quer apagar um m&oacute;dulo? &Eacute; este o assistente a usar. Em dois simples passos o m&oacute;dulo ser&aacute; destru&iacute;do.
		Esta a&ccedil;&atilde;o n&atilde;o pode ser desfeita. Note que tamb&eacute;m pode desativar m&oacute;dulos nas <b>Defini&ccedil;&otilde;es</b>
        Assim oculta o m&oacute;dulo sem o apagar. Esta op&ccedil;&atilde;o n&atilde;o est&aacute; dispon&iacute;vel sem ter criado ou importado 
		um m&oacute;dulo personalizado.
        </td></tr>
        <tr><td><img src="./images/tb_wizard_pt.png" alt="" border="0"></td>
        <td><a href="../modules/exportmodulewizard.html">Assistente Exportar m&oacute;dulo</a>.  
        Ent&atilde;o criou este espantoso m&oacute;dulo personalizado! Tanto trabalho e s&oacute; est&aacute; dispon&iacute;vel para si. Porque 
		n&atilde;o partilh&aacute;-lo com outras pessoas? Use este assistente para exportar a estrutura do m&oacute;dulo com todas as defini&ccedil;&otilde;es
		respetivas, dados e imagens. Esta op&ccedil;&atilde;o n&atilde;o est&aacute; dispon&iacute;vel sem ter criado ou importado 
		um m&oacute;dulo personalizado.
        </td></tr>           
        <tr><td><img src="./images/tb_wizard_pt.png" alt="" border="0"></td>
        <td><a href="../modules/importmodulewizard.html">Assistente Importar m&oacute;dulo</a>.  
        Esta ferramenta permite-lhe importar um m&oacute;dulo previamente exportado com o <i>Assistente de exporta&ccedil;&atilde;o de m&oacute;dulo</i>. 
		&Eacute; um processo simples que vai carregar o m&oacute;dulo, os seus itens, defini&ccedil;&otilde;es e imagens.
        </td></tr>
        <tr><td><img src="./images/accept_pt.png" alt="" border="0"></td>
        <td><a href="#">M&oacute;dulos ativos</a>.  
        Daqui alterna entre m&oacute;dulos. Simplesmente selecione o m&oacute;dulo para come&ccedil;ar a utiliz&aacute;-lo. Este menu est&aacute;
		presente se desativou a lista de m&oacute;dulos, a &aacute;rea onde os m&oacute;dulos normalmente s&atilde;o selecionados.
        </td></tr>
    </table>    

    <h2>Ver</h2>
    
    <table>
        <tr><td><img src="./images/tb_viewcard_pt.gif" alt="" border="0"></td>
        <td><a href="../items/views.html">Ver Cart&atilde;o</a>. 
        O cart&atilde;o &eacute; a vista mais atraente. Os items s&atilde;o mostrados como pequenos cart&otilde;es e mostram uma imagem 
		e uma curta descri&ccedil;&atilde;o do item, baseada <a href="../settings/fields.html">campos definidos</a> como, "Descritivo?".
        </td></tr>    
        <tr><td><img src="./images/tb_viewtable_pt.gif" alt="" border="0"></td>
        <td><a href="../items/views.html">Ver Tabela</a>. 
        A vista tabela permite-lhe editar itens diretamente na vista, sem ter de abrir o formul&aacute;rio de item.
        </td></tr>
        <tr><td><img src="./images/tb_toggle_pt.png" alt="" border="0"></td>
        <td><a href="../filters/filters.html">Alternar barra de filtragem r&aacute;pida</a>. 
        Ativa ou desativa a barra de filtragem r&aacute;pida.
        </td></tr>
        <tr><td><img src="./images/tb_toggle_pt.png" alt="" border="0"></td>
        <td><a href="../general/screen_layout.html">Alternar lista de m&oacute;dulos</a>. 
        Ativa ou desativa a lista de m&oacute;dulos.
        </td></tr>
        <tr><td><img src="./images/tb_toggle_pt.png" alt="" border="0"></td>
        <td><a href="../general/quickview.html">Alternar vista r&aacute;pida</a>. 
        Ativa ou desativa a vista r&aacute;pida.
        </td></tr> 
        <tr><td><img src="./images/tb_toggle_pt.png" alt="" border="0"></td>
        <td><a href="../general/grouping_pane.html">Alternar painel de agrupamento</a>. 
        Ativa ou desativa o painel de agrumpamento.
        </td></tr>
        <tr><td><img src="./images/tb_toggle_pt.png" alt="" border="0"></td>
        <td><a href="../general/toolbar.html">Alternar barra de ferramentas</a>. 
        Ativa ou desativa a barra de ferramentas.
        </td></tr>         

    </table>    

    <h2>Filtrar</h2>
    <table>
        <tr><td><img src="./images/tb_filter_pt.gif" alt="" border="0"></td>
        <td><a href="../filters/filters.html">Filtrar</a>. 
        Aqui pode definir filtros complexos para encontrar os seus itens. At&eacute; os pode gravar, para que os possa usar no futuro.
        </td></tr>    
        <tr><td><img src="./images/tb_filteragain_pt.gif" alt="" border="0"></td>
        <td><a href="../filters/filters.html">Reaplicar filtro</a>. 
        Aplica o filtro novamente, atualizando completamente a vista.
        </td></tr>
        <tr><td><img src="./images/tb_delete_pt.png" alt="" border="0"></td>
        <td><a href="../filters/filters.html">Desfazer o filtro atual</a>. 
        Remove todos os filtros e carrega todos os itens.
        </td></tr> 
    </table>
    
    <h2>Defini&ccedil;&otilde;es</h2>
    <table>
        <tr><td><img src="./images/tb_settings_pt.png" alt="" border="0"></td>
        <td><a href="../settings/general.html">Defini&ccedil;&otilde;es</a>. 
        A janela de <b>Defini&ccedil;&otilde;es</b> permite-lhe alterar todas as defini&ccedil;&otilde;es do sistema, tal com as de servidor proxy, 
		associa&ccedil;&otilde;es de programas, op&ccedil;&otilde;es de letra e muito muito mais. Estas defini&ccedil;&otilde;es s&atilde;o armazenadas
        por computador. Portanto, se tiver m&uacute;ltiplas instala&ccedil;&otilde;es, em m&uacute;ltiplos computadores, mas partilha a mesma
        pasta de utilizador, estas defini&ccedil;&otilde;es n&atilde;o s&atilde;o partilhadas entre computadores. Tudo o resto &eacute; partilhado 
		menos estas defini&ccedil;&otilde;es.
        </td></tr>    
        <tr><td><img src="./images/tb_settings_pt.png" alt="" border="0"></td>
        <td><a href="../settings/fields.html">Defini&ccedil;&otilde;es gerais de campos</a>. 
        N&atilde;o quer usar um certo campo? Quer alterar o r&oacute;tulo de um dos campos? Pode encontrar aqui toda e qualquer op&ccedil;&atilde;o 
		de campos. Estas s&atilde;o defini&ccedil;&otilde;es muito importantes e &eacute; sempre bom dar uma vista de olhos a esta sec&ccedil;&atilde;o.
        A parte mais importante poder&aacute; ser a possibilidade de indicar como os seus campos s&atilde;o descritos com a op&ccedil;&atilde;o 
		"Descritivo?". Leia mais <a href="../filters/fields.html">aqui</a>.
        </td></tr>
        <tr><td><img src="./images/tb_settings_pt.png" alt="" border="0"></td>
        <td><a href="../settings/quickview.html">Defini&ccedil;&otilde;es de vista r&aacute;pida</a>. 
        A <a href="../general/quickview.html">vista r&aacute;pida</a> pode ser adaptada aos seus desejos. Aqui pode indicar que campos 
		s&atilde;o mostrados e em que ordem. 
        </td></tr> 
        <tr><td><img src="./images/tb_settings_pt.png" alt="" border="0"></td>
        <td><a href="../settings/cardview.html">Defini&ccedil;&otilde;es de vista</a>. 
        Para modificar a vista atual, tal como as cores e a informa&ccedil;&atilde;o a mostrar, tem de usar as <b>Defini&ccedil;&otilde;es de vista</b>. 
        As defini&ccedil;&otilde;es diferem ligeiramente entre <a href="../settings/cardview.html">ver Cart&atilde;o</a> e 
		<a href="../settings/tableview.html">ver Tabela</a>.
        </td></tr> 
        <tr><td><img src="./images/tb_settings_pt.png" alt="" border="0"></td>
        <td><a href="../settings/webfields.html">Defini&ccedil;&otilde;es de campos Web</a>. 
        Aqui pode alterar os campos como mostrado na <a href="../webserver/webserver.html">aplica&ccedil;&atilde;o Web</a> do Data Crow.
        </td></tr>
        <tr><td><img src="./images/tb_settings_pt.png" alt="" border="0"></td>
        <td><a href="../settings/itemformsettings.html">Defini&ccedil;&otilde;es do formul&aacute;rio de item</a>. 
        Altere a apar&ecirc;ncia do <a href="../items/itemform.html">Formul&aacute;rio de item</a>. At&eacute; pode atribuir campos a separadores
		e alterar a ordem dos campos.
        </td></tr> 
        <tr><td><img src="./images/tb_laf_pt.png" alt="" border="0"></td>
        <td><a href="../settings/laf.html">Apar&ecirc;ncia &amp; utiliza&ccedil;&atilde;o</a>. 
        Esta op&ccedil;&atilde;o determina a apar&ecirc;ncia dos campos e outros objetos na aplica&ccedil;&atilde;o. &Eacute; melhor experimentar por si mesmo!
        </td></tr>
        <tr><td><img src="./images/tb_settings_pt.png" alt="" border="0"></td>
        <td><a href="../tools/resource_editor.html">Editor de recursos</a>. 
        Qualquer r&oacute;tulo pode ser alterado ou traduzido usando este editor. Pode at&eacute; criar uma nova tradu&ccedil;&atilde;o.
        </td></tr>         
    </table>    

    <h2>Utilizador</h2>
    <table>
        <tr><td><img src="./images/tb_settings_pt.png" alt="" border="0"></td>
        <td><a href="#">Alterar palavra-passe</a>. 
        Altere aqui a sua pr&oacute;pria palavra-passe.
        </td></tr> 
    </table>    
    
    <h2>Ferramentas</h2>
    <table>
        <tr><td><img src="./images/tb_fileimport_pt.png" alt="" border="0"></td>
        <td><a href="../tools/fileinformationimport.html">Importar ficheiros</a>. 
        Extrai informa&ccedil;&atilde;o de ficheiros no seu sistema. Por exemplo, para &aacute;lbuns de m&uacute;sica o Data Crow pode obter o nome do artista 
		e do &aacute;lbum do mp3 ou outros formatos de ficheiro. Adicionalmente, pode encontrar informa&ccedil;&atilde;o em falta usando um dos 
        <a href="../onlinesearch/onlinesearch.html">servi&ccedil;os online</a>. 
        Esta ferramenta s&oacute; est&aacute; dispon&iacute;vel para m&oacute;dulo/itens "baseados" em ficheiros. N&atilde;o deve ser confundido
		com a capacidade do Data Crow de importar itens de ficheiros de texto. 
        Use <a href="../tools/item_import.html">Importar itens</a> para importar itens de ficheiros CSV, texto ou XML.
        </td></tr> 
        <tr><td><img src="./images/tb_onlinesearch_pt.png" alt="" border="0"></td>
        <td><a href="../onlinesearch/onlinesearch.html">Procura online</a>. 
        Encontre informa&ccedil;&atilde;o sobre os seus itens online, selecione o item e grave-o.<br>
		Nem todos os m&oacute;dulos t&ecirc;m esta ferramenta dispon&iacute;vel. M&oacute;dulos personalizados tamb&eacute;m n&atilde;o a ter&atilde;o a menos que tenha programado uma 
		especificamente para o seu m&oacute;dulo.
        </td></tr>
        <tr><td><img src="./images/tb_massupdate_pt.png" alt="" border="0"></td>
        <td><a href="../tools/mass_update.html">Atualiza&ccedil;&atilde;o em massa</a>. 
        Atualize muitos itens de uma s&oacute; vez, usando as capacidades do Data Crow para procura online e importa&ccedil;&atilde;o de ficheiros. 
        </td></tr>
        <tr><td><img src="./images/tb_report_pt.png" alt="" border="0"></td>
        <td><a href="../reports/reporting.html">Criar relat&oacute;rio</a>. 
        Crie relat&oacute;rios HTML e PDF. Se esta op&ccedil;&atilde;o de menu n&atilde;o estiver dispon&iacute;vel, significa que n&atilde;o foram 
		definidos ficheiros XSLT (modelos de relat&oacute;rio) para o seu m&oacute;dulo.
		H&aacute; um manual sobre como fazer isto na <a href="http://www.datacrow.net/">p&aacute;gina do Data Crow</a>.
        </td></tr>
        <tr><td><img src="./images/tb_charts_pt.png" alt="" border="0"></td>
        <td><a href="../charts/charts.html">Gr&aacute;ficos</a>. 
        Crie uma representa&ccedil;&atilde;o gr&aacute;fica da informa&ccedil;&atilde;o dos seus itens. 
        </td></tr>
        <tr><td><img src="./images/tb_itemexport_pt.png" alt="" border="0"></td>
        <td><a href="../tools/item_export.html">Assistente de exporta&ccedil;&atilde;o de itens</a>. 
        Exporte os seus itens para um ficheiro CSV ou XML (recomendado).
        </td></tr>
        <tr><td><img src="./images/tb_itemimport_pt.png" alt="" border="0"></td>
        <td><a href="../tools/item_import.html">Assistente Importar itens</a>. 
        Importe os seus itens de um ficheiro CSV ou XML.
        </td></tr>
        <tr><td><img src="./images/tb_createmultiple_pt.png" alt="" border="0"></td>
        <td><a href="../items/create_multiple.html">Criar m&uacute;ltiplos itens</a>. 
        Permite a cria&ccedil;&atilde;o manual de m&uacute;ltiplos itens
        </td></tr>
        <tr><td><img src="./images/tb_updateall_pt.png" alt="" border="0"></td>
        <td><a href="../tools/update_all.html">Atualizar tudo</a>. 
        Atualize muitos itens (ou todos..) de uma s&oacute; vez. Esta &eacute; uma ferramenta simples mas poderosa, aplicando valores 
		introduzidos manualmente, a m&uacute;ltiplos itens em simult&acirc;neo.
        </td></tr>
        <tr><td><img src="./images/tb_updateall_pt.png" alt="" border="0"></td>
        <td><a href="../tools/findreplace.html">Localizar &amp; substituir</a>. 
        Substituir um valor por outro nos campos de texto. Vai-lhe mostrar uma pr&eacute;-visualiza&ccedil;&atilde;o (com sorte) antes de aplicar
		a substitui&ccedil;&atilde;o aos seus itens.
        </td></tr>
        <tr><td><img src="./images/tb_autonumberer_pt.png" alt="" border="0"></td>
        <td><a href="../tools/auto_numbering.html">Autonumera&ccedil;&atilde;o</a>. 
        Numere, ou renumere os seus itens. Todos e todos em simult&acirc;neo. At&eacute; tem op&ccedil;&otilde;es para ignorar ou preencher 
		espa&ccedil;os na numera&ccedil;&atilde;o.
        </td></tr>
        <tr><td><img src="./images/tb_updateall_pt.png" alt="" border="0"></td>
        <td><a href="../tools/title_rewriter.html">Reescrever t&iacute;tulo/nome</a>. 
        Reescreve os t&iacute;tulos dos seus itens. &Eacute; uma excelente ferramenta para alterar t&iacute;tulos de "O Doutor" para "Doutor, O"
		O <a href="../tools/associate_name_rewriter.html">escritor de nomes</a> &eacute; diferente para registos de pessoas em 
		oposi&ccedil;&atilde;o a <a href="../tools/title_rewriter.html">outros itens</a>.
        </td></tr>   
        <tr><td><img src="./images/tb_backuprestore_pt.png" alt="" border="0"></td>
        <td><a href="../tools/backup_restore.html">C&oacute;pia &amp; restauro de seguran&ccedil;as</a>. 
        Crie uma c&oacute;pia de seguran&ccedil;a completa dos seus dados, incluindo defini&ccedil;&otilde;es, m&oacute;dulos e imagens. 
		E tamb&eacute;m permite o restauro das c&oacute;pias (estou s&oacute; a dizer...).
        </td></tr> 
        <tr><td><img src="./images/tb_settings_pt.png" alt="" border="0"></td>
        <td><a href="../tools/database_editor.html">Editor de base de dados</a>. 
        Acesso direto &agrave; base de dados. Ignora todas as regras de seguran&ccedil;a que eu implementei na aplica&ccedil;&atilde;o. Use por sua pr&oacute;pria conta e risco! 
        (<b>fa&ccedil;a.. c&oacute;pias de seguran&ccedil;a..</b>)
        </td></tr>
        <tr><td><img src="./images/tb_drivemanager_pt.png" alt="" border="0"></td>
        <td><a href="../tools/drivemanager.html">Gestor de unidades</a>. 
        Procura nas suas unidades por ficheiros adicionados ao Data Crow e corrige as liga&ccedil;&otilde;es aos ficheiros no caso de os ficheiros
		terem sido movidos ou renomeados. Uma ferramenta subvalorizada mas oh t&atilde;o sofisticada.
        </td></tr>  
        <tr><td><img src="./images/tb_filerenamer.png" alt="" border="0"></td>
        <td><a href="../tools/filerenamer.html">Renomear ficheiros</a>. 
        Renomear ficheiros nas suas unidades baseado na informa&ccedil;&atilde;o presente no Data Crow. Tamb&eacute;m pode mover ficheiros para outra 
		localiza&ccedil;&atilde;o e nova estrutra de pastas. Mostra-lhe uma pr&eacute;-visualiza&ccedil;&atilde;o antes de efetuar qualquer a&ccedil;&atilde;o.
        </td></tr>        
    </table>      

    <h2>Plugins</h2>
    Este menu n&atilde;o est&aacute; presente por predefini&ccedil;&atilde;o. S&oacute; ser&aacute; mostrado se tiver instalado plugins personalizados.

    <h2>Servidor Web</h2>
    Este menu s&oacute; aparece se tiver instalado a <a href="../webserver/webserver.html">aplica&ccedil;&atilde;o Web</a>. 
    Pode usar este menu para alterar as defini&ccedil;&otilde;es do servidor Web e inici&aacute;-lo.

    <h2>Ajuda</b></h2>
    Cont&eacute;m liga&ccedil;&otilde;es ao di&aacute;logo <b>Acerca de</b>, sugest&atilde;o do dia, p&aacute;gina de donativos e a esta ajuda.

</body>
</html>
