<!DOCTYPE HTML PUBLIC "-//W3C//DTD HTML 4.01 Transitional//EN">

<html>
<head>
    <link href="../datacrow_help.css" rel="stylesheet" type="text/css">
</head>

<body>

    <h1>Vista r&aacute;pida</h1>
    A <b>Vista r&aacute;pida</b> faz uma representa&ccedil;&atilde;o r&aacute;pida do item. Sempre que clicar num item na vista o seu conte&uacute;do
    ser&aacute; mostrado na vista r&aacute;pida. 
    
    <br><br><img src="./images/quickview_pt.png" alt="" border="0"><br><br>
    
    O t&iacute;tulo como mostrado no separador <b>Descri&ccedil;&atilde;o</b> &eacute; baseado nas <a href="../settings/fields.html">defini&ccedil;&otilde;es 
	dos campos</a>.	&Eacute; a combina&ccedil;&atilde;o dos campos marcados como "Descritivo?".
    
    <br><br><img src="./images/quickview_title_pt.png" alt="" border="0"><br><br>
    
    Tamb&eacute;m pode abrir o item daqui, simplesmente fazendo duplo clique na vista r&aacute;pida. <br><br>
    
    Sec&ccedil;&otilde;es sublinhadas s&atilde;o itens, ficheiros ou liga&ccedil;&otilde;es Web em que pode clicar (isto depende do tipo de campo).
    Abaixo est&aacute; um exemplo de dois itens, categorias, que podem ser abertas clicando nas suas liga&ccedil;&otilde;es:<br><br>
    <br><img src="./images/quickview_links_pt.png" alt="" border="0"><br><br>
    Para itens ser&aacute; aberto o <a href="../general/itemform.html">Formul&aacute;rio de item</a>. Os ficheiros e liga&ccedil;&otilde;es Web 
	s&atilde;o geridos pelo seu pr&oacute;prio sistema operativo; uma liga&ccedil;&atilde;o Web muito provavelmente ser&aacute; aberta no seu navegador predefinido, 
	um ficheiro ser&aacute; aberto com o programa a ele associado. <br><br>
    
    Se as suas <a href="../settings/quickview.html">defini&ccedil;&otilde;es de Vista r&aacute;pida</a> o permitirem 
	e se o seu item tiver imagens, estas ser&atilde;o mostradas em separadores diferentes. Clique no separador correspondente para ver a imagem:
        
    <br><br><img src="./images/quickview_pictures_pt.png" alt="" border="0"><br><br>
    
    <h2>Op&ccedil;&otilde;es</h2>
    Clique com o bot&atilde;o direito na vista r&aacute;pida para abrir o menu de op&ccedil;&otilde;es.
    <br><br><img src="./images/quickview_options_pt.png" alt="" border="0"><br><br>
    
    <table>
        </td></tr>
        <tr><td><img src="./images/tb_toggle_pt.png" alt="" border="0"></td>
        <td><a href="../general/quickview.html">Ocultar vista r&aacute;pida</a>. 
        Esta op&ccedil;&atilde;o vai ocultar a vista r&aacute;pida. 
        Pode ser ativada a partir do menu <a href="../general/menubar.html">Ver</a> ou usando a tecla F9 quando a tem desativada.
        </td></tr> 
        <tr><td><img src="./images/tb_settings_pt.png" alt="" border="0"></td>
        <td><a href="../settings/quickview.html">Defini&ccedil;&otilde;es de vista r&aacute;pida</a>. 
        A vista r&aacute;pida pode ser modificada de acordo com os seus desejos. 
        Aqui pode indicar que campos devem ser mostrados e em que ordem. 
        </td></tr>         
    </table>
    
</body>
</html>
