<html lang="pt">
<head>
    <link href="../datacrow_help.css" rel="stylesheet" type="text/css">
</head>

<body>
    <h1>Onde come&ccedil;ar?</h1>
    
    Tudo bem.. Instalei o Data Crow e n&atilde;o tenho ideia por onde come&ccedil;ar. Felizmente encontrei a ajuda.<br><br>
    
    Vou presumir que sabe que o Data Crow &eacute; um programa de gest&atilde;o de cole&ccedil;&otilde;es. No Data Crow pode registar
    os seus itens. Para permitir o registo de itens, o Data Crow vem com uma s&eacute;rie de m&oacute;dulos, com Filmes,
    Programas e Livros. Encontrar&aacute; estes m&oacute;dulos na lista de m&oacute;dulos, &eacute; imposs&iacute;vel falhar.
    
    <br><br><img src="./images/view_modulelist_pt.jpg" /><br><br>
    
    A primeira coisa a fazer &eacute; abrir o m&oacute;dulo que quer usar. Simplesmente clique no &iacute;cone.
    
    <br><br>
    
    Abriu o m&oacute;dulo e est&aacute; pronto a introduzir os seus itens. <br><br>
    Agora, como vai fazer isto depende de j&aacute; ter ou n&atilde;o uma lista dos seus itens.
    Talvez esteja a usar outro produto, ou talvez tenha s&oacute; um ficheiro de texto ou uma folha de c&aacute;lculo com 
	informa&ccedil;&atilde;o b&aacute;sica acerca dos seus itens. 
    
    <h2>N&atilde;o tenho nada registado</h2>
    No caso de estar a come&ccedil;ar do zero, ter&aacute; de criar os seus itens manualmente. 
    Vamos, n&atilde;o tenha medo, n&atilde;o precisa de introduzir quase nada &agrave; m&atilde;o! 
    
    <h3>Os meus itens s&atilde;o representados por ficheiros no meu sistema</h3>
    Se quer criar itens dentro do Data Crow baseados em ficheiros no seu sistema, por exemplo filmes ou m&uacute;sicas, 
    pode usar um <b>Importador de ficheiros</b> para criar itens do Data Crow baseados nestes ficheiros. O Data Crow vai extrair 
	tanta informa&ccedil;&atilde;o quanto poss&iacute;vel dos seus ficheiros.<br><br>
    Leia esta <a href="../tools/fileinformationimport.html">sec&ccedil;&atilde;o</a> para mais informa&ccedil;&atilde;o sobre o 
	<b>Importador de ficheiros</b>.
    
    <h3>Os meus itens n&atilde;o s&atilde;o baseados em ficheiros</h3>
    Se n&atilde;o tem ficheiros para importar pode tentar usar a <a href="../onlinesearch/onlinesearch.html">procura online</a> 
	para encontrar informa&ccedil;&atilde;o sobre o seu item. Isto poupa-lhe uma quantidade de dactilografia! A procura online usa p&aacute;ginas 
	(ou servi&ccedil;os como lhes chamamos) como a Amazon, Imdb.com e outros para encontrar informa&ccedil;&atilde;o e imagens para os seus itens.<br><br>
    
    Ent&atilde;o, h&aacute; um <a href="../items/wizard.html">Assistente de item</a> que faz uso da funcionalidade de procura online. Eu
	recomendo que comece a&iacute;. Clique em <img src="../general/images/tb_wizard_pt.png" /> na <a href="../general/toolbar.html">barra de ferramentas</a>.
    Este assistente existe para ajudar novos utilizadores a adicionar itens um por um.<br><br>

    Se se considera um utilizador proficiente tamb&eacute;m pode tentar a procura online diretamente. 
    O benef&iacute;cio vem de poder adicionar m&uacute;ltiplos itens rapidamente. 
    Leia esta <a href="../onlinesearch/onlinesearch.html">sec&ccedil;&atilde;o</a> para mais informa&ccedil;&atilde;o sobre a funcionalidade de procura online.
    
    <h3>N&atilde;o consegui encontrar informa&ccedil;&atilde;o acerca dos meus itens</h3>
    Bem, ent&atilde;o... come&ccedil;ou do zero, os seus itens n&atilde;o s&atilde;o representados por ficheiros e a procura online n&atilde;o 
	encontrou nada de &uacute;til para si. Ter&aacute; de introduzir os itens manualmente.<br><br>
    
    Clique em <img src="../general/images/tb_add_pt.png" /> na <a href="../general/toolbar.html">barra de ferramentas</a> para adicionar um novo item.
	Isto vai abrir o <a href="../items/itemform.html">Formul&aacute;rio de item</a>. Introduza a informa&ccedil;&atilde;o manualmente neste formul&aacute;rio.<br><br>
    
    O Data Crow ainda o pode ajudar a tornar esta tarefa t&atilde;o simples quanto poss&iacute;vel.<br>
    Por exemplo, se tem ficheiros com muitos valores em comum pode criar um modelo com valores predefinidos. Os items baseados neste modelo
	recebem imediatamente estes valores. Leia mais sobre isto <a href="../items/templates.html">aqui</a>.
    
    <br><br>
    
    Agora, se tem muitos itens para adicionar h&aacute; uma &uacute;ltima op&ccedil;&atilde;o. Use a funcionalidade "Criar m&uacute;ltiplos items".
	Isto &eacute; explicado na sec&ccedil;&atilde;o <a href="../items/create_multiple.html">Items</a> da ajuda. Certifique-se que ativa
    <a href="../items/views_tableview.html">Ver como tabela</a>. Assim pode introduzir os itens como se fosse uma folha de c&aacute;lculo.
    
    <h2>J&aacute; registei os meus itens noutro programa</h2>
    O Data Crow tem a capacidade de importar ficheiros de texto, tanto XML como CSV (ou outros com texto delimitado). 
    Se registou os seus iten num formato de texto como o mencionado, ou se pode exportar a informa&ccedil;&atilde;o para um destes formatos,
    pode importar a informa&ccedil;&atilde;o diretamente para o Data Crow.<br><br>
    
    Ter&aacute; de utilizar a funcionalidade <a href="../tools/item_import.html">Importar itens</a>. 
    
  </body>
</html>
