<html>
  <head>
        <link href="../datacrow_help.css" rel="stylesheet" type="text/css">
  </head>
  <body>
    <h1>Seguran&ccedil;a</h1>
    <i>Barra de m&oacute;dulos &gt; Utilizadores</i><br><br>

    A seguran&ccedil;a &eacute; definida no m&oacute;dulo <i>Utilizadores</i>.
       
    <br><br><img src="./images/security_module_pt.png" alt="" border="0"><br><br>

	Por predefini&ccedil;&atilde;o, qualquer utilizador que inicie a sua instala&ccedil;&atilde;o do Crow
	ver&aacute; toda a informa&ccedil;&atilde;o que introduziu. Poder&aacute; inclusivamente alterar ou 
	apagar os seus itens.<br>
	Ao criar utilizadores determina quais &eacute; que t&ecirc;m acesso e o que &eacute; que s&atilde;o 
	autorizados a fazer. Os utilizadores s&atilde;o criados no m&oacute;dulo <i>Utilizadores</i> (este 
	m&oacute;dulo s&oacute; est&aacute; dispon&iacute;vel para administradores). O m&oacute;dulo funciona
	 como qualquer outro m&oacute;dulo. Pode criar, procurar, modificar e remover utilizadores.
	<br><br>
	
	<h2>Situa&ccedil;&atilde;o predefinida</h2>
	Por predefini&ccedil;&atilde;o, j&aacute; existe um administrador no Data Crow. Este utilizador tem 
	o nome predefinido "sa". N&atilde;o tem palavra-passe definida, o que permite ao Data Crow iniciar 
	sess&atilde;o automaticamente. Esta &eacute; a situa&ccedil;&atilde;o predefinida.
	
	<h2>Criar um utilizador</h2>
	Pode criar um utilizador selecionando o m&oacute;dulo <i>Utilizadores</i> e escolhendo "Criar novo". Abre o
	<a href="../items/itemform.html">formul&aacute;rio de item</a> e pode come&ccedil;ar a introduzir 
	informa&ccedil;&atilde;o. 
	
	<br><br><img src="./images/security_user_pt.png" alt="" border="0"><br><br>
	
	A informa&ccedil;&atilde;o mais importante a introduzir &eacute; o "Nome de utilizador". 
	Este nome &eacute; usado para iniciar sess&atilde;o no Data Crow. Uma vez gravado, o nome de utilizador 
	<b><u>n&atilde;o</b></u> pode ser alterado!<br>
	A propriedade "Admin" (desmarcada por predefini&ccedil;&atilde;o) &eacute; muito importante. Se a marcar,
	o utilizador torna-se um administrador e ter&aacute; todas as permiss&otilde;es no Data Crow. Recomenda-se 
	que s&oacute; haja um administrador.
	
	<h2>Administradores</h2>
	Algumas opera&ccedil;&otilde;es s&oacute; s&atilde;o permitidas a administradores: <br>
	
    <table>
        <tr><td>-</td>
        <td>Remover/apagar itens.</td></tr>
        <tr><td>-</td>
        <td>Alterar as defini&ccedil;&otilde;es da aplica&ccedil;&atilde;o.</td></tr>
        <tr><td>-</td>
        <td>Gerir utilizadores.</td></tr>        
        <tr><td>-</td>
        <td>Criar modelos.</td></tr>   
    </table>   	

	<h2>Permiss&otilde;es dos m&oacute;dulos</h2>
	No separador <b>Permiss&otilde;es do m&oacute;dulo</b> pode definir os direitos de acesso do utilizador para o 
	m&oacute;dulo e os campos. Para cada campo, tem a op&ccedil;&atilde;o de permitir a edi&ccedil;&atilde;o e a 
	visualiza&ccedil;&atilde;o.
	
	<br><br><img src="./images/security_module_permissions_pt.png" alt="" border="0"><br><br>
	
	Ao desmarcar todos os direitos num campo torna-o invis&iacute;vel, o utilizador n&atilde;o poder&aacute; ver 
	nem editar o campo.
	<br><br>
	Para negar acesso a um m&oacute;dulo, ter&aacute; de desmarcar todos os dreitos para todos os campos. 
	<br><br>
	Usando o menu <b>Editar</b> pode rapidamente definir todos os campos como s&oacute; de leitura ("Permitir ver 
	todos os campos") ou como edit&aacute;veis ("Permitir editar todos os campos"). Para negar acesso ao m&oacute;dulo 
	(removendo todos os direitos de todos os campos) pode usar a op&ccedil;&atilde;o de menu "Negar acesso ao m&oacute;dulo".
	
	<h2>Permiss&otilde;es do Plugin</h2>
	Alguns plugins s&oacute; est&atilde;o dispon&iacute;veis depois de os utilizadores terem acesso autorizado. No separador 
	<b>Permiss&otilde;es do Plugin</b> pode dar ou negar permiss&atilde;o ao utilizador, marcando ou desmarcando a caixa correspondente.
		
	<h2>Alterar a plavra-passe</h2>
	<i>Caminho de menu: Utilizador &gt; Alterar palavra-passe</i><br><br>
	As palavras-passe n&atilde;o s&atilde;o predefinidas. No menu <b>Utilizador</b> pode alterar a sua palavra-passe 
	("Alterar palavra-passe"). Primeiro introduza a palavra-passe atual (ou deixe em branco se ainda n&atilde;o definiu nenhuma)
	e depois introduza a nova palavra-passe duas vezes.
  </body>
</html>
